org-pages/leisure/dc.org
#+TITLE: Arrowverse - Selftracking DC's arrowverse
#+DESCRIPTION: luispengler.github.io/site - Arrowverse - Selftracking DC's arrowverse
#+SETUPFILE:  https://luispengler.github.io/site/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil ^:{} toc:1

* Getting started
Another compilation of arroverse viewing order you can find on the net...\\
=Note 1= As much as I'd like to make this a mainstream project, I can't. This webpage's only purpose is of helping me check my progress while watching arrowverse.

=Note 2= This viewing order comes from an amazing open-source project. Check it out: [[https://arrowverse.info/][arrowverse.info]]

|------------------+--------------------+---------------------+---------------+--------------------+------------------------------+-----------------------------------+-------------------------+------------------+------------------+-------------------------|
| Arrow   (170 ep) | The Flash (151 ep) | Constantine (13 ep) | Vixen (12 ep) | Supergirl (126 ep) | Legends of Tomorrow (102 ep) | Freedom Fighters: The Ray (12 ep) | Black Lightning (58 ep) | Batwoman (43 ep) | Stargirl (26 ep) | Superman & Lois (15 ep) |

There are *734 episodes* in arrowverse as of November 13th, 2022. If every episode on this list is at least 40 minutes long, then the total *watch time would be of 29360 minutes or 489,33 hours, which is 20 days and 9 hours.*

**  [[https://github.com/luispengler/site/commit/d3bcccd1755bebf9cf722e844e43e994bf1345be#diff-d8fcf12ffd178198924d2369cc02b14d48dcbf87cfb2184498a7ac20f3c5b4cc][Version 1.0]] (Added: Constantine, Vixen, Freedom Fighters: The Ray; counted new episodes)

* An arrow on ya [46/46] [100%]
+ [X] Arrow - 1.01: "Pilot"
+ [X] Arrow - 1.02: "Honor Thy Father"
+ [X] Arrow - 1.03: "Lone Gunmen"
+ [X] Arrow - 1.04: "An Innocent Man"
+ [X] Arrow - 1.05: "Damaged"
+ [X] Arrow - 1.06: "Legacies"
+ [X] Arrow - 1.07: "Muse of Fire"
+ [X] Arrow - 1.08: "Vendetta"
+ [X] Arrow - 1.09: "Year's End"
+ [X] Arrow - 1.10: "Burned"
+ [X] Arrow - 1.11: "Trust but Verify"
+ [X] Arrow - 1.12: "Vertigo"
+ [X] Arrow - 1.13: "Betrayal"
+ [X] Arrow - 1.14: "The Odyssey"
+ [X] Arrow - 1.15: "Dodger"
+ [X] Arrow - 1.16: "Dead to Rights"
+ [X] Arrow - 1.17: "The Huntress Returns"
+ [X] Arrow - 1.18: "Salvation"
+ [X] Arrow - 1.19: "Unfinished Business"
+ [X] Arrow - 1.20: "Home Invasion"
+ [X] Arrow - 1.21: "The Undertaking"
+ [X] Arrow - 1.22: "Darkness on the Edge of Town"
+ [X] Arrow - 1.23: "Sacrifice"
+ [X] Arrow - 2.01: "City of Heroes"
+ [X] Arrow - 2.02: "Identity"
+ [X] Arrow - 2.03: "Broken Dolls"
+ [X] Arrow - 2.04: "Crucible"
+ [X] Arrow - 2.05: "League of Assassins"
+ [X] Arrow - 2.06: "Keep Your Enemies Closer"
+ [X] Arrow - 2.07: "State v. Queen"
+ [X] Arrow - 2.08: "The Scientist"
+ [X] Arrow - 2.09: "Three Ghosts"
+ [X] Arrow - 2.10: "Blast Radius"
+ [X] Arrow - 2.11: "Blind Spot"
+ [X] Arrow - 2.12: "Tremors"
+ [X] Arrow - 2.13: "Heir to the Demon"
+ [X] Arrow - 2.14: "Time of Death"
+ [X] Arrow - 2.15: "The Promise"
+ [X] Arrow - 2.16: "Suicide Squad"
+ [X] Arrow - 2.17: "Birds of Prey"
+ [X] Arrow - 2.18: "Deathstroke"
+ [X] Arrow - 2.19: "The Man Under the Hood"
+ [X] Arrow - 2.20: "Seeing Red"
+ [X] Arrow - 2.21: "City of Blood"
+ [X] Arrow - 2.22: "Streets of Fire"
+ [X] Arrow - 2.23: "Unthinkable"

