html/org-pages/dc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-27 Thu 08:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Arrowverse - Selftracking DC's arrowverse</title>
<meta name="author" content="Luís Spengler" />
<meta name="description" content="luispengler.github.io/site - Arrowverse - Selftracking DC's arrowverse" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://luispengler.github.io/site/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Arrowverse - Selftracking DC&rsquo;s arrowverse</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf0fc9d3">Getting started</a></li>
<li><a href="#org8cb5ca9">An arrow on ya <code>[46/46]</code> <code>[100%]</code></a></li>
<li><a href="#orgb6d445a">2014/2015 <code>[64/64]</code> <code>[100%]</code></a></li>
<li><a href="#org701f32d">2015/2016 <code>[82/82]</code> <code>[100%]</code></a></li>
<li><a href="#org6a68818">2016/2017 <code>[91/91]</code> <code>[100%]</code></a></li>
<li><a href="#org8e4e498">2017/2018 <code>[112/112]</code> <code>[100%]</code></a></li>
<li><a href="#org78bbd7e">2018/2019 <code>[32/98]</code> <code>[32%]</code></a></li>
<li><a href="#orgdc7e633">2019/2020 <code>[0/112]</code> <code>[0%]</code></a></li>
<li><a href="#org1f77a1c">2020/2021 <code>[0/104]</code> <code>[0%]</code></a></li>
<li><a href="#orgfb2d957">2021/2022 <code>[0/41]</code> <code>[0%]</code></a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf0fc9d3" class="outline-2">
<h2 id="orgf0fc9d3">Getting started</h2>
<div class="outline-text-2" id="text-orgf0fc9d3">
<p>
Another compilation of arroverse viewing order you can find on the net&#x2026;<br />
<code>Note 1</code> As much as I&rsquo;d like to make this a mainstream project I can&rsquo;t. This webpage serves the only porpouse of helping me check my progress while watching arrowverse.<br />
<code>Note 2</code> This viewing order comes from this amazing open-source project, check it out: <a href="https://arrowverse.info/">arrowverse.info</a>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Arrow   (170 ep)</td>
<td class="org-left">The Flash (151 ep)</td>
<td class="org-left">Constantine (13 ep)</td>
<td class="org-left">Vixen (12 ep)</td>
<td class="org-left">Supergirl (126 ep)</td>
<td class="org-left">Legends of Tomorrow (102 ep)</td>
<td class="org-left">Freedom Fighters: The Ray (12 ep)</td>
<td class="org-left">Black Lightning (58 ep)</td>
<td class="org-left">Batwoman (43 ep)</td>
<td class="org-left">Stargirl (26 ep)</td>
<td class="org-left">Superman &amp; Lois (15 ep)</td>
</tr>
</tbody>
</table>

<p>
There are <b>734 episodes</b> in arrowverse as of November 13th, 2022. If every episode on this list is at least 40 minutes long, then the total <b>watch time would be of 29360 minutes or 489,33 hours, which is 20 days and 9 hours.</b>
</p>
</div>

<div id="outline-container-org4a67f68" class="outline-3">
<h3 id="org4a67f68"><a href="https://github.com/luispengler/site/commit/d3bcccd1755bebf9cf722e844e43e994bf1345be#diff-d8fcf12ffd178198924d2369cc02b14d48dcbf87cfb2184498a7ac20f3c5b4cc">Version 1.0</a> (Added: Constantine, Vixen, Freedom Fighters: The Ray; counted new episodes)</h3>
</div>
</div>

<div id="outline-container-org8cb5ca9" class="outline-2">
<h2 id="org8cb5ca9">An arrow on ya <code>[46/46]</code> <code>[100%]</code></h2>
<div class="outline-text-2" id="text-org8cb5ca9">
<ul class="org-ul">
<li class="on"><code>[X]</code> Arrow - 1.01: &ldquo;Pilot&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.02: &ldquo;Honor Thy Father&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.03: &ldquo;Lone Gunmen&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.04: &ldquo;An Innocent Man&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.05: &ldquo;Damaged&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.06: &ldquo;Legacies&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.07: &ldquo;Muse of Fire&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.08: &ldquo;Vendetta&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.09: &ldquo;Year&rsquo;s End&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.10: &ldquo;Burned&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.11: &ldquo;Trust but Verify&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.12: &ldquo;Vertigo&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.13: &ldquo;Betrayal&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.14: &ldquo;The Odyssey&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.15: &ldquo;Dodger&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.16: &ldquo;Dead to Rights&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.17: &ldquo;The Huntress Returns&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.18: &ldquo;Salvation&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.19: &ldquo;Unfinished Business&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.20: &ldquo;Home Invasion&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.21: &ldquo;The Undertaking&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.22: &ldquo;Darkness on the Edge of Town&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 1.23: &ldquo;Sacrifice&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.01: &ldquo;City of Heroes&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.02: &ldquo;Identity&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.03: &ldquo;Broken Dolls&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.04: &ldquo;Crucible&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.05: &ldquo;League of Assassins&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.06: &ldquo;Keep Your Enemies Closer&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.07: &ldquo;State v. Queen&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.08: &ldquo;The Scientist&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.09: &ldquo;Three Ghosts&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.10: &ldquo;Blast Radius&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.11: &ldquo;Blind Spot&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.12: &ldquo;Tremors&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.13: &ldquo;Heir to the Demon&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.14: &ldquo;Time of Death&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.15: &ldquo;The Promise&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.16: &ldquo;Suicide Squad&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.17: &ldquo;Birds of Prey&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.18: &ldquo;Deathstroke&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.19: &ldquo;The Man Under the Hood&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.20: &ldquo;Seeing Red&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.21: &ldquo;City of Blood&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.22: &ldquo;Streets of Fire&rdquo;</li>
<li class="on"><code>[X]</code> Arrow - 2.23: &ldquo;Unthinkable&rdquo;</li>
</ul>
</div>
</div>
