org-pages/leisure/dc.org
* 2014/2015 [64/64] [100%]

+ [X] The Flash – 1.01: “Pilot”
+ [X] Arrow – 3.01: “The Calm”
+ [X] The Flash -  1.02: “Fastest Man Alive”
+ [X] Arrow – 3.02: “Sara”
+ [X] The Flash – 1.03: “Things You Can’t Outrun”
+ [X] Arrow – 3.03: “Corto Maltese”
+ [X] Constantine - 1.01: "Non Est Asylum"
+ [X] The Flash – 1.04: “Going Rogue”
+ [X] Arrow – 3.04: “The Magician”
+ [X] Constantine - 1.02: "The Darkness Beneath"
+ [X] Arrow -  3.05: “The Secret Origin of Felicity Smoak”
+ [X] Constantine - 1.03: "The Devil's Vinyl"
+ [X] The Flash -  1.05: “Plastique”
+ [X] Arrow – 3.06: “Guilty”
+ [X] Constantine - 1.04: "A Feast of Friends"
+ [X] The Flash – 1.06: “The Flash Is Born”
+ [X] Arrow – 3.07: “Draw Back Your Bow”
+ [X] Constantine - 1.05: "Danse Vaudou"
+ [X] The Flash – 1.07: “Power Outage”
+ [X] Constantine - 1.06: "Rage of Caliban"
+ [X] The Flash – 1.08: “Flash vs. Arrow” *MUST BE WATCHED TOGETHER (1)*
+ [X] Arrow – 3.08: “The Brave and the Bold” *MUST BE WATCHED TOGETHER (2)*
+ [X] Constantine - 1.07: "Blessed Are the Damned"
+ [X] The Flash – 1.09: “The Man in the Yellow Suit”
+ [X] Arrow – 3.09: “The Climb”
+ [X] Constantine - 1.08: "The Saint of Last Resorts"
+ [X] Constantine - 1.09: "The Saint of Last Resorts: Part 2"
+ [X] Arrow – 3.10: “Left Behind”
+ [X] Constantine - 1.10: "Quid Pro Quo"
+ [X] The Flash – 1.11: “The Sound and the Fury”
+ [X] Arrow – 3.11: “Midnight City”
+ [X] Constantine - 1.11: "A Whole World Out There"
+ [X] The Flash - 1×12: “Crazy for You”
+ [X] Arrow – 3.12: “Uprising”
+ [X] Constantine - 1.12: "Angels and Ministers of Grace"
+ [X] The Flash - 1×13: “The Nuclear Man”
+ [X] Arrow – 3.13: “Canaries”
+ [X] Constantine - 1.13: "Waiting for the Man"
+ [X] The Flash - 1×14: “Fallout”
+ [X] Arrow – 3.14: “The Return”
+ [X] Arrow -  3.15: “Nanda Parbat”
+ [X] The Flash – 1.15: “Out of Time”
+ [X] The Flash – 1.16: “Rogue Time”
+ [X] Arrow -  3.16: “The Offer”
+ [X] The Flash -  1.17: “Tricksters”
+ [X] Arrow – 3.17: “Suicidal Tendencies”
+ [X] Arrow – 3.18: “Public Enemy”
+ [X] The Flash – 1.18: “All Star Team Up”
+ [X] Arrow -  3.19: “Broken Arrow”
+ [X] The Flash – 1.19: “Who Is Harrison Wells?”
+ [X] Arrow -  3.20: “The Fallen”
+ [X] The Flash – 1.20: “The Trap”
+ [X] Arrow – 3.21: “Al Sah-him”
+ [X] The Flash – 1.21: “Grodd Lives”
+ [X] Arrow – 3.22: “This Is Your Sword”
+ [X] The Flash – 1.22: “Rogue Air”
+ [X] Arrow – 3.23: “My Name Is Oliver Queen”
+ [X] The Flash – 1.23: “Fast Enough”
+ [X] Vixen - 1.01: "Episode 1"
+ [X] Vixen - 1.02: "Episode 2"
+ [X] Vixen - 1.03: "Episode 3"
+ [X] Vixen - 1.04: "Episode 4"
+ [X] Vixen - 1.05: "Episode 5"
+ [X] Vixen - 1.06: "Episode 6"

