html/org-pages/dc.html

<div id="outline-container-orgb6d445a" class="outline-2">
<h2 id="orgb6d445a">2014/2015 <code>[64/64]</code> <code>[100%]</code></h2>
<div class="outline-text-2" id="text-orgb6d445a">
<ul class="org-ul">
<li class="on"><code>[X]</code> The Flash – 1.01: “Pilot”</li>
<li class="on"><code>[X]</code> Arrow – 3.01: “The Calm”</li>
<li class="on"><code>[X]</code> The Flash -  1.02: “Fastest Man Alive”</li>
<li class="on"><code>[X]</code> Arrow – 3.02: “Sara”</li>
<li class="on"><code>[X]</code> The Flash – 1.03: “Things You Can’t Outrun”</li>
<li class="on"><code>[X]</code> Arrow – 3.03: “Corto Maltese”</li>
<li class="on"><code>[X]</code> Constantine - 1.01: &ldquo;Non Est Asylum&rdquo;</li>
<li class="on"><code>[X]</code> The Flash – 1.04: “Going Rogue”</li>
<li class="on"><code>[X]</code> Arrow – 3.04: “The Magician”</li>
<li class="on"><code>[X]</code> Constantine - 1.02: &ldquo;The Darkness Beneath&rdquo;</li>
<li class="on"><code>[X]</code> Arrow -  3.05: “The Secret Origin of Felicity Smoak”</li>
<li class="on"><code>[X]</code> Constantine - 1.03: &ldquo;The Devil&rsquo;s Vinyl&rdquo;</li>
<li class="on"><code>[X]</code> The Flash -  1.05: “Plastique”</li>
<li class="on"><code>[X]</code> Arrow – 3.06: “Guilty”</li>
<li class="on"><code>[X]</code> Constantine - 1.04: &ldquo;A Feast of Friends&rdquo;</li>
<li class="on"><code>[X]</code> The Flash – 1.06: “The Flash Is Born”</li>
<li class="on"><code>[X]</code> Arrow – 3.07: “Draw Back Your Bow”</li>
<li class="on"><code>[X]</code> Constantine - 1.05: &ldquo;Danse Vaudou&rdquo;</li>
<li class="on"><code>[X]</code> The Flash – 1.07: “Power Outage”</li>
<li class="on"><code>[X]</code> Constantine - 1.06: &ldquo;Rage of Caliban&rdquo;</li>
<li class="on"><code>[X]</code> The Flash – 1.08: “Flash vs. Arrow” <b>MUST BE WATCHED TOGETHER (1)</b></li>
<li class="on"><code>[X]</code> Arrow – 3.08: “The Brave and the Bold” <b>MUST BE WATCHED TOGETHER (2)</b></li>
<li class="on"><code>[X]</code> Constantine - 1.07: &ldquo;Blessed Are the Damned&rdquo;</li>
<li class="on"><code>[X]</code> The Flash – 1.09: “The Man in the Yellow Suit”</li>
<li class="on"><code>[X]</code> Arrow – 3.09: “The Climb”</li>
<li class="on"><code>[X]</code> Constantine - 1.08: &ldquo;The Saint of Last Resorts&rdquo;</li>
<li class="on"><code>[X]</code> Constantine - 1.09: &ldquo;The Saint of Last Resorts: Part 2&rdquo;</li>
<li class="on"><code>[X]</code> Arrow – 3.10: “Left Behind”</li>
<li class="on"><code>[X]</code> Constantine - 1.10: &ldquo;Quid Pro Quo&rdquo;</li>
<li class="on"><code>[X]</code> The Flash – 1.11: “The Sound and the Fury”</li>
<li class="on"><code>[X]</code> Arrow – 3.11: “Midnight City”</li>
<li class="on"><code>[X]</code> Constantine - 1.11: &ldquo;A Whole World Out There&rdquo;</li>
<li class="on"><code>[X]</code> The Flash - 1×12: “Crazy for You”</li>
<li class="on"><code>[X]</code> Arrow – 3.12: “Uprising”</li>
<li class="on"><code>[X]</code> Constantine - 1.12: &ldquo;Angels and Ministers of Grace&rdquo;</li>
<li class="on"><code>[X]</code> The Flash - 1×13: “The Nuclear Man”</li>
<li class="on"><code>[X]</code> Arrow – 3.13: “Canaries”</li>
<li class="on"><code>[X]</code> Constantine - 1.13: &ldquo;Waiting for the Man&rdquo;</li>
<li class="on"><code>[X]</code> The Flash - 1×14: “Fallout”</li>
<li class="on"><code>[X]</code> Arrow – 3.14: “The Return”</li>
<li class="on"><code>[X]</code> Arrow -  3.15: “Nanda Parbat”</li>
<li class="on"><code>[X]</code> The Flash – 1.15: “Out of Time”</li>
<li class="on"><code>[X]</code> The Flash – 1.16: “Rogue Time”</li>
<li class="on"><code>[X]</code> Arrow -  3.16: “The Offer”</li>
<li class="on"><code>[X]</code> The Flash -  1.17: “Tricksters”</li>
<li class="on"><code>[X]</code> Arrow – 3.17: “Suicidal Tendencies”</li>
<li class="on"><code>[X]</code> Arrow – 3.18: “Public Enemy”</li>
<li class="on"><code>[X]</code> The Flash – 1.18: “All Star Team Up”</li>
<li class="on"><code>[X]</code> Arrow -  3.19: “Broken Arrow”</li>
<li class="on"><code>[X]</code> The Flash – 1.19: “Who Is Harrison Wells?”</li>
<li class="on"><code>[X]</code> Arrow -  3.20: “The Fallen”</li>
<li class="on"><code>[X]</code> The Flash – 1.20: “The Trap”</li>
<li class="on"><code>[X]</code> Arrow – 3.21: “Al Sah-him”</li>
<li class="on"><code>[X]</code> The Flash – 1.21: “Grodd Lives”</li>
<li class="on"><code>[X]</code> Arrow – 3.22: “This Is Your Sword”</li>
<li class="on"><code>[X]</code> The Flash – 1.22: “Rogue Air”</li>
<li class="on"><code>[X]</code> Arrow – 3.23: “My Name Is Oliver Queen”</li>
<li class="on"><code>[X]</code> The Flash – 1.23: “Fast Enough”</li>
<li class="on"><code>[X]</code> Vixen - 1.01: &ldquo;Episode 1&rdquo;</li>
<li class="on"><code>[X]</code> Vixen - 1.02: &ldquo;Episode 2&rdquo;</li>
<li class="on"><code>[X]</code> Vixen - 1.03: &ldquo;Episode 3&rdquo;</li>
<li class="on"><code>[X]</code> Vixen - 1.04: &ldquo;Episode 4&rdquo;</li>
<li class="on"><code>[X]</code> Vixen - 1.05: &ldquo;Episode 5&rdquo;</li>
<li class="on"><code>[X]</code> Vixen - 1.06: &ldquo;Episode 6&rdquo;</li>
</ul>
</div>
</div>
