org-pages/leisure/dc.org
* 2015/2016 [82/82] [100%]

+ [X] Supergirl - 1.01: "Pilot"
+ [X] Supergirl - 1.02: "Stronger Together"
+ [X] Supergirl - 1.03: "Fight or Flight"
+ [X] Supergirl - 1.04: "How Does She Do It?"
+ [X] Supergirl - 1.05: "Livewire"
+ [X] Supergirl - 1.06: "Red Faced"
+ [X] Supergirl - 1.07: "Human for a Day"
+ [X] Supergirl - 1.08: "Hostile Takeover"
+ [X] Supergirl - 1.09: "Blood Bonds"
+ [X] Supergirl - 1.10: "Childish Things"
+ [X] Supergirl - 1.11: "Strange Visitor From Another Planet"
+ [X] Supergirl - 1.12: "Bizarro"
+ [X] Supergirl - 1.13: "For the Girl Who Has Everything"
+ [X] Supergirl - 1.14: "Truth, Justice and the American Way"
+ [X] Supergirl - 1.15: "Solitude"
+ [X] Supergirl - 1.16: "Falling"
+ [X] Supergirl - 1.17: "Manhunter"
+ [X] The Flash – 2.01: “The Man Who Saved Central City”
+ [X] Arrow – 4.01: “Green Arrow”
+ [X] The Flash – 2.02: “Flash of Two Worlds”
+ [X] Arrow – 4.02: “The Candidate”
+ [X] The Flash – 2.03: “Family of Rogues”
+ [X] Arrow – 4.03: “Restoration”
+ [X] The Flash – 2.04: “The Fury of Firestorm”
+ [X] Arrow – 4.04: “Beyond Redemption”
+ [X] The Flash – 2.05: “The Darkness and the Light”
+ [X] Arrow -  4.05: “Haunted”
+ [X] The Flash – 2.06: “Enter Zoom”
+ [X] Arrow – 4.06: “Lost Souls”
+ [X] The Flash – 2.07: “Gorilla Warfare”
+ [X] Arrow – 4.07: “Brotherhood”
+ [X] The Flash – 2.08: “Legends of Today”
+ [X] Arrow – 4.08: “Legends of Yesterday”
+ [X] The Flash – 2.09: “Running to Stand Still”
+ [X] Arrow – 4.09: “Dark Waters”
+ [X] The Flash – 2.10: “Potential Energy”
+ [X] Arrow – 4.10: “Blood Debts”
+ [X] Legends of Tomorrow – “1.01: Pilot, Part 1”
+ [X] Legends of Tomorrow – “1.01: Pilot, Part 2”
+ [X] The Flash – 2.11: “The Reverse-Flash Returns”
+ [X] Arrow – 4.11: “A.W.O.L.”
+ [X] The Flash – 2.12: “Fast Lane”
+ [X] Arrow – 4.12: “Unchained”
+ [X] Arrow – 4.13: “Sins of the Father”
+ [X] Legends of Tomorrow – 1.03: “Blood Ties”
+ [X] The F﻿lash – 2.13: “Welcome to Earth-2”
+ [X] The Flash – 2.14: “Escape from Earth-2”
+ [X] Legends of Tomorrow – 1.04: “White Knights”
+ [X] Legends of Tomorrow – 1.05: “Fail-Safe”
+ [X] Arrow – 4.14: “Code of Silence”
+ [X] The Flash – 2.15: “King Shark”
+ [X] Arrow – 4.15: “Taken”
+ [X] Legends of Tomorrow – 1.06: “Star City 2046”
+ [X] Legends of Tomorrow – 1.07: “Marooned”
+ [X] Legends of Tomorrow – 1.08: “Night of the Hawk”
+ [X] The Flash – 2.16: “Trajectory”
+ [X] Arrow – 4.16: “Broken Hearts”
+ [X] The Flash – 2.17: “Flash Back”
+ [X] Supergirl – 1.18: “Worlds Finest”
+ [X] Supergirl – 1.19: "Myriad"
+ [X] Supergirl - 1:20: "Better Angels"
+ [X] Arrow – 4.17: “Beacon of Hope”
+ [X] Legends of Tomorrow – 1.09: “Left Behind”
+ [X] Arrow – 4.18: “Eleven-Fifty-Nine”
+ [X] Legends of Tomorrow – 1.10: “Progeny”
+ [X] Legends of Tomorrow – 1.11: “The Magnificent Eight”
+ [X] The Flash – 2.18: “Versus Zoom”
+ [X] Legends of Tomorrow – 1.12: “Last Refuge”
+ [X] The Flash – 2.19: “Back to Normal”
+ [X] Legends of Tomorrow – 1.13: “Leviathan”
+ [X] The Flash – 2.20: “Rupture”
+ [X] Legends of Tomorrow – 1.14: “River of Time”
+ [X] The Flash – 2.21: “The Runaway Dinosaur”
+ [X] Arrow – 4.19: “Canary Cry”
+ [X] Arrow – 4.20: “Genesis”
+ [X] Arrow – 4.21: “Monument Point”
+ [X] Legends of Tomorrow – 1.15: ” Destiny”
+ [X] The Flash – 2.22: “Invincible”
+ [X] Arrow – 4.22: “Lost in the Flood”
+ [X] Legends of Tomorrow – 1.16: “Legendary”
+ [X] The Flash – 2.23: “The Race of His Life”
+ [X] Arrow – 4.23: “Schism”

