html/org-pages/dc.html

<div id="outline-container-org701f32d" class="outline-2">
<h2 id="org701f32d">2015/2016 <code>[82/82]</code> <code>[100%]</code></h2>
<div class="outline-text-2" id="text-org701f32d">
<ul class="org-ul">
<li class="on"><code>[X]</code> Supergirl - 1.01: &ldquo;Pilot&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.02: &ldquo;Stronger Together&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.03: &ldquo;Fight or Flight&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.04: &ldquo;How Does She Do It?&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.05: &ldquo;Livewire&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.06: &ldquo;Red Faced&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.07: &ldquo;Human for a Day&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.08: &ldquo;Hostile Takeover&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.09: &ldquo;Blood Bonds&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.10: &ldquo;Childish Things&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.11: &ldquo;Strange Visitor From Another Planet&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.12: &ldquo;Bizarro&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.13: &ldquo;For the Girl Who Has Everything&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.14: &ldquo;Truth, Justice and the American Way&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.15: &ldquo;Solitude&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.16: &ldquo;Falling&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1.17: &ldquo;Manhunter&rdquo;</li>
<li class="on"><code>[X]</code> The Flash – 2.01: “The Man Who Saved Central City”</li>
<li class="on"><code>[X]</code> Arrow – 4.01: “Green Arrow”</li>
<li class="on"><code>[X]</code> The Flash – 2.02: “Flash of Two Worlds”</li>
<li class="on"><code>[X]</code> Arrow – 4.02: “The Candidate”</li>
<li class="on"><code>[X]</code> The Flash – 2.03: “Family of Rogues”</li>
<li class="on"><code>[X]</code> Arrow – 4.03: “Restoration”</li>
<li class="on"><code>[X]</code> The Flash – 2.04: “The Fury of Firestorm”</li>
<li class="on"><code>[X]</code> Arrow – 4.04: “Beyond Redemption”</li>
<li class="on"><code>[X]</code> The Flash – 2.05: “The Darkness and the Light”</li>
<li class="on"><code>[X]</code> Arrow -  4.05: “Haunted”</li>
<li class="on"><code>[X]</code> The Flash – 2.06: “Enter Zoom”</li>
<li class="on"><code>[X]</code> Arrow – 4.06: “Lost Souls”</li>
<li class="on"><code>[X]</code> The Flash – 2.07: “Gorilla Warfare”</li>
<li class="on"><code>[X]</code> Arrow – 4.07: “Brotherhood”</li>
<li class="on"><code>[X]</code> The Flash – 2.08: “Legends of Today”</li>
<li class="on"><code>[X]</code> Arrow – 4.08: “Legends of Yesterday”</li>
<li class="on"><code>[X]</code> The Flash – 2.09: “Running to Stand Still”</li>
<li class="on"><code>[X]</code> Arrow – 4.09: “Dark Waters”</li>
<li class="on"><code>[X]</code> The Flash – 2.10: “Potential Energy”</li>
<li class="on"><code>[X]</code> Arrow – 4.10: “Blood Debts”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – “1.01: Pilot, Part 1”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – “1.01: Pilot, Part 2”</li>
<li class="on"><code>[X]</code> The Flash – 2.11: “The Reverse-Flash Returns”</li>
<li class="on"><code>[X]</code> Arrow – 4.11: “A.W.O.L.”</li>
<li class="on"><code>[X]</code> The Flash – 2.12: “Fast Lane”</li>
<li class="on"><code>[X]</code> Arrow – 4.12: “Unchained”</li>
<li class="on"><code>[X]</code> Arrow – 4.13: “Sins of the Father”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.03: “Blood Ties”</li>
<li class="on"><code>[X]</code> The F﻿lash – 2.13: “Welcome to Earth-2”</li>
<li class="on"><code>[X]</code> The Flash – 2.14: “Escape from Earth-2”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.04: “White Knights”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.05: “Fail-Safe”</li>
<li class="on"><code>[X]</code> Arrow – 4.14: “Code of Silence”</li>
<li class="on"><code>[X]</code> The Flash – 2.15: “King Shark”</li>
<li class="on"><code>[X]</code> Arrow – 4.15: “Taken”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.06: “Star City 2046”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.07: “Marooned”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.08: “Night of the Hawk”</li>
<li class="on"><code>[X]</code> The Flash – 2.16: “Trajectory”</li>
<li class="on"><code>[X]</code> Arrow – 4.16: “Broken Hearts”</li>
<li class="on"><code>[X]</code> The Flash – 2.17: “Flash Back”</li>
<li class="on"><code>[X]</code> Supergirl – 1.18: “Worlds Finest”</li>
<li class="on"><code>[X]</code> Supergirl – 1.19: &ldquo;Myriad&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl - 1:20: &ldquo;Better Angels&rdquo;</li>
<li class="on"><code>[X]</code> Arrow – 4.17: “Beacon of Hope”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.09: “Left Behind”</li>
<li class="on"><code>[X]</code> Arrow – 4.18: “Eleven-Fifty-Nine”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.10: “Progeny”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.11: “The Magnificent Eight”</li>
<li class="on"><code>[X]</code> The Flash – 2.18: “Versus Zoom”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.12: “Last Refuge”</li>
<li class="on"><code>[X]</code> The Flash – 2.19: “Back to Normal”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.13: “Leviathan”</li>
<li class="on"><code>[X]</code> The Flash – 2.20: “Rupture”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.14: “River of Time”</li>
<li class="on"><code>[X]</code> The Flash – 2.21: “The Runaway Dinosaur”</li>
<li class="on"><code>[X]</code> Arrow – 4.19: “Canary Cry”</li>
<li class="on"><code>[X]</code> Arrow – 4.20: “Genesis”</li>
<li class="on"><code>[X]</code> Arrow – 4.21: “Monument Point”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.15: ” Destiny”</li>
<li class="on"><code>[X]</code> The Flash – 2.22: “Invincible”</li>
<li class="on"><code>[X]</code> Arrow – 4.22: “Lost in the Flood”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 1.16: “Legendary”</li>
<li class="on"><code>[X]</code> The Flash – 2.23: “The Race of His Life”</li>
<li class="on"><code>[X]</code> Arrow – 4.23: “Schism”</li>
</ul>
</div>
</div>
