org-pages/leisure/dc.org
* 2016/2017 [91/91] [100%]

+ [X] The Flash – 3.01: “Flashpoint”
+ [X] Arrow – 5.01: “Legacy”
+ [X] Supergirl – 2.01: “The Adventures of Supergirl”
+ [X] The Flash – 3.02: “Paradox”
+ [X] Arrow – 5.02: “The Recruits”
+ [X] Legends of Tomorrow – 2.01: “Out of Time”
+ [X] Vixen - 2.01: "Episode 1"
+ [X] Supergirl – 2.02: “The Last Children of Krypton”
+ [X] The Flash – 3.03: “Magenta”
+ [X] Arrow – 5.03: “A Matter of Trust”
+ [X] Legends of Tomorrow – 2.02: “The Justice Society of America”
+ [X] Vixen - 2.02: "Episode 2"
+ [X] Supergirl – 2.03: “Welcome to Earth”
+ [X] The Flash – 3.04: “The New Rogues”
+ [X] Arrow – 5.04: “Penance”
+ [X] Legends of Tomorrow – 2.03: “Shogun”
+ [X] Vixen - 2.03: "Episode 3"
+ [X] Supergirl – 2.04: “Survivors”
+ [X] The Flash – 3.05: “Monster”
+ [X] Arrow – 5.05: “Human Target”
+ [X] Legends of Tomorrow – 2.04: “Abominations”
+ [X] Vixen - 2.04: "Episode 4"
+ [X] Supergirl – 2.05: “Crossfire”
+ [X] Arrow – 5.06: “So It Begins”
+ [X] Legends of Tomorrow – 2.05: “Compromised”
+ [X] Vixen - 2.05: "Episode 5"
+ [X] Supergirl – 2.06: “Changing”
+ [X] The Flash – 3.06: “Shade”
+ [X] Arrow – 5.07: “Vigilante”
+ [X] Legends of Tomorrow – 2.06: “Outlaw Country”
+ [X] Vixen - 2.06: "Episode 6"
+ [X] Supergirl – 2.07: “The Darkest Place”
+ [X] The Flash – 3.07: “Killer Frost”
+ [X] Supergirl – 2.08: “Medusa” *MUST BE WATCHED TOGETHER (1)*
+ [X] The Flash – 3.08: “Invasion!” *MUST BE WATCHED TOGETHER (2)*
+ [X] Arrow – 5.08: “Invasion!” *MUST BE WATCHED TOGETHER (3)*
+ [X] Legends of Tomorrow – 2.07: “Invasion!” *MUST BE WATCHED TOGETHER (4)*
+ [X] The Flash – 3.09: “The Present”
+ [X] Arrow – 5.09: “What We Leave Behind”
+ [X] Legends of Tomorrow – 2.08: “The Chicago Way”
+ [X] Supergirl – 2.09: “Supergirl Lives”
+ [X] The Flash – 3.10: “Borrowing Problems From The Future”
+ [X] Legends of Tomorrow – 2.09: “Raiders of the Lost Art”
+ [X] Arrow – 5.10: “Who Are You”
+ [X] Supergirl – 2.10: “We Can Be Heroes”
+ [X] The Flash – 3.11: “Dead or Alive”
+ [X] Legends of Tomorrow – 2.10: “The Legion of Doom”
+ [X] Arrow – 5.11: “Second Chances”
+ [X] Supergirl – 2.11: “The Martian Chronicles”
+ [X] The Flash – 3.12: “Untouchable”
+ [X] Legends of Tomorrow – 2.11: “Turncoat”
+ [X] Arrow – 5.12: “Bratva”
+ [X] Supergirl – 2.12: “Luthors”
+ [X] Arrow – 5.13: “Spectre of the Gun”
+ [X] Supergirl – 2.13: “Mr. & Mrs. Mxyzptlk”
+ [X] The Flash – 3.13: “Attack on Gorilla City”
+ [X] Legends of Tomorrow – 2.12: “Camelot/3000”
+ [X] Arrow – 5.14: “The Sin-Eater”
+ [X] Supergirl – 2.14: “Homecoming”
+ [X] The Flash – 3.14: “Attack on Central City”
+ [X] Arrow – 5.15: “Fighting Fire with Fire”
+ [X] Supergirl – 2.15: “Exodus”
+ [X] The Flash – 3.15: “The Wrath of Savitar”
+ [X] Legends of Tomorrow – 2.13: “Land of the Lost”
+ [X] The Flash – 3.16: “Into The Speed Force”
+ [X] Legends of Tomorrow – 2.14: “Moonshot”
+ [X] Arrow – 5.16: “Checkmate”
+ [X] Supergirl – 2.16: “Star-Crossed”  *MUST BE WATCHED TOGETHER (1)*
+ [X] The Flash – 3.17: “Duet” *MUST BE WATCHED TOGETHER (2)*
+ [X] Legends of Tomorrow – 2.15: “Fellowship of the Spear”
+ [X] Arrow – 5.17: “Kapiushon”
+ [X] Supergirl – 2.17: “Distance Sun”
+ [X] The Flash – 3.18: “Abra Kadabra”
+ [X] Legends of Tomorrow – 2.16: “Doomworld”
+ [X] Arrow – 5.18: “Disbanded”
+ [X] Legends of Tomorrow – 2.17: “Aruba”
+ [X] Supergirl – 2.18: “Ace Reporter”
+ [X] The Flash – 3.19: “The Once and Future Flash”
+ [X] Arrow – 5.19: “Dangerous Liaisons”
+ [X] Supergirl – 2.19: “Alex”
+ [X] The Flash – 3.20: “I Know Who You Are”
+ [X] Arrow – 5.20: “Underneath”
+ [X] Supergirl – 2.20: “City of Lost Children”
+ [X] The Flash – 3.21: “Cause and Effect”
+ [X] Arrow – 5.21: “Honor Thy Fathers”
+ [X] Supergirl – 2.21: “Resist”
+ [X] The Flash – 3.22: “Infantino Street”
+ [X] Arrow – 5.22: “Missing”
+ [X] Supergirl – 2.22: “Nevertheless, She Persisted”
+ [X] The Flash – 3.23: “Finish Line”
+ [X] Arrow – 5.23: “Lian Yu”

