html/org-pages/dc.html

<div id="outline-container-org6a68818" class="outline-2">
<h2 id="org6a68818">2016/2017 <code>[91/91]</code> <code>[100%]</code></h2>
<div class="outline-text-2" id="text-org6a68818">
<ul class="org-ul">
<li class="on"><code>[X]</code> The Flash – 3.01: “Flashpoint”</li>
<li class="on"><code>[X]</code> Arrow – 5.01: “Legacy”</li>
<li class="on"><code>[X]</code> Supergirl – 2.01: “The Adventures of Supergirl”</li>
<li class="on"><code>[X]</code> The Flash – 3.02: “Paradox”</li>
<li class="on"><code>[X]</code> Arrow – 5.02: “The Recruits”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.01: “Out of Time”</li>
<li class="on"><code>[X]</code> Vixen - 2.01: &ldquo;Episode 1&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl – 2.02: “The Last Children of Krypton”</li>
<li class="on"><code>[X]</code> The Flash – 3.03: “Magenta”</li>
<li class="on"><code>[X]</code> Arrow – 5.03: “A Matter of Trust”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.02: “The Justice Society of America”</li>
<li class="on"><code>[X]</code> Vixen - 2.02: &ldquo;Episode 2&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl – 2.03: “Welcome to Earth”</li>
<li class="on"><code>[X]</code> The Flash – 3.04: “The New Rogues”</li>
<li class="on"><code>[X]</code> Arrow – 5.04: “Penance”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.03: “Shogun”</li>
<li class="on"><code>[X]</code> Vixen - 2.03: &ldquo;Episode 3&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl – 2.04: “Survivors”</li>
<li class="on"><code>[X]</code> The Flash – 3.05: “Monster”</li>
<li class="on"><code>[X]</code> Arrow – 5.05: “Human Target”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.04: “Abominations”</li>
<li class="on"><code>[X]</code> Vixen - 2.04: &ldquo;Episode 4&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl – 2.05: “Crossfire”</li>
<li class="on"><code>[X]</code> Arrow – 5.06: “So It Begins”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.05: “Compromised”</li>
<li class="on"><code>[X]</code> Vixen - 2.05: &ldquo;Episode 5&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl – 2.06: “Changing”</li>
<li class="on"><code>[X]</code> The Flash – 3.06: “Shade”</li>
<li class="on"><code>[X]</code> Arrow – 5.07: “Vigilante”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.06: “Outlaw Country”</li>
<li class="on"><code>[X]</code> Vixen - 2.06: &ldquo;Episode 6&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl – 2.07: “The Darkest Place”</li>
<li class="on"><code>[X]</code> The Flash – 3.07: “Killer Frost”</li>
<li class="on"><code>[X]</code> Supergirl – 2.08: “Medusa” <b>MUST BE WATCHED TOGETHER (1)</b></li>
<li class="on"><code>[X]</code> The Flash – 3.08: “Invasion!” <b>MUST BE WATCHED TOGETHER (2)</b></li>
<li class="on"><code>[X]</code> Arrow – 5.08: “Invasion!” <b>MUST BE WATCHED TOGETHER (3)</b></li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.07: “Invasion!” <b>MUST BE WATCHED TOGETHER (4)</b></li>
<li class="on"><code>[X]</code> The Flash – 3.09: “The Present”</li>
<li class="on"><code>[X]</code> Arrow – 5.09: “What We Leave Behind”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.08: “The Chicago Way”</li>
<li class="on"><code>[X]</code> Supergirl – 2.09: “Supergirl Lives”</li>
<li class="on"><code>[X]</code> The Flash – 3.10: “Borrowing Problems From The Future”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.09: “Raiders of the Lost Art”</li>
<li class="on"><code>[X]</code> Arrow – 5.10: “Who Are You”</li>
<li class="on"><code>[X]</code> Supergirl – 2.10: “We Can Be Heroes”</li>
<li class="on"><code>[X]</code> The Flash – 3.11: “Dead or Alive”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.10: “The Legion of Doom”</li>
<li class="on"><code>[X]</code> Arrow – 5.11: “Second Chances”</li>
<li class="on"><code>[X]</code> Supergirl – 2.11: “The Martian Chronicles”</li>
<li class="on"><code>[X]</code> The Flash – 3.12: “Untouchable”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.11: “Turncoat”</li>
<li class="on"><code>[X]</code> Arrow – 5.12: “Bratva”</li>
<li class="on"><code>[X]</code> Supergirl – 2.12: “Luthors”</li>
<li class="on"><code>[X]</code> Arrow – 5.13: “Spectre of the Gun”</li>
<li class="on"><code>[X]</code> Supergirl – 2.13: “Mr. &amp; Mrs. Mxyzptlk”</li>
<li class="on"><code>[X]</code> The Flash – 3.13: “Attack on Gorilla City”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.12: “Camelot/3000”</li>
<li class="on"><code>[X]</code> Arrow – 5.14: “The Sin-Eater”</li>
<li class="on"><code>[X]</code> Supergirl – 2.14: “Homecoming”</li>
<li class="on"><code>[X]</code> The Flash – 3.14: “Attack on Central City”</li>
<li class="on"><code>[X]</code> Arrow – 5.15: “Fighting Fire with Fire”</li>
<li class="on"><code>[X]</code> Supergirl – 2.15: “Exodus”</li>
<li class="on"><code>[X]</code> The Flash – 3.15: “The Wrath of Savitar”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.13: “Land of the Lost”</li>
<li class="on"><code>[X]</code> The Flash – 3.16: “Into The Speed Force”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.14: “Moonshot”</li>
<li class="on"><code>[X]</code> Arrow – 5.16: “Checkmate”</li>
<li class="on"><code>[X]</code> Supergirl – 2.16: “Star-Crossed”  <b>MUST BE WATCHED TOGETHER (1)</b></li>
<li class="on"><code>[X]</code> The Flash – 3.17: “Duet” <b>MUST BE WATCHED TOGETHER (2)</b></li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.15: “Fellowship of the Spear”</li>
<li class="on"><code>[X]</code> Arrow – 5.17: “Kapiushon”</li>
<li class="on"><code>[X]</code> Supergirl – 2.17: “Distance Sun”</li>
<li class="on"><code>[X]</code> The Flash – 3.18: “Abra Kadabra”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.16: “Doomworld”</li>
<li class="on"><code>[X]</code> Arrow – 5.18: “Disbanded”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 2.17: “Aruba”</li>
<li class="on"><code>[X]</code> Supergirl – 2.18: “Ace Reporter”</li>
<li class="on"><code>[X]</code> The Flash – 3.19: “The Once and Future Flash”</li>
<li class="on"><code>[X]</code> Arrow – 5.19: “Dangerous Liaisons”</li>
<li class="on"><code>[X]</code> Supergirl – 2.19: “Alex”</li>
<li class="on"><code>[X]</code> The Flash – 3.20: “I Know Who You Are”</li>
<li class="on"><code>[X]</code> Arrow – 5.20: “Underneath”</li>
<li class="on"><code>[X]</code> Supergirl – 2.20: “City of Lost Children”</li>
<li class="on"><code>[X]</code> The Flash – 3.21: “Cause and Effect”</li>
<li class="on"><code>[X]</code> Arrow – 5.21: “Honor Thy Fathers”</li>
<li class="on"><code>[X]</code> Supergirl – 2.21: “Resist”</li>
<li class="on"><code>[X]</code> The Flash – 3.22: “Infantino Street”</li>
<li class="on"><code>[X]</code> Arrow – 5.22: “Missing”</li>
<li class="on"><code>[X]</code> Supergirl – 2.22: “Nevertheless, She Persisted”</li>
<li class="on"><code>[X]</code> The Flash – 3.23: “Finish Line”</li>
<li class="on"><code>[X]</code> Arrow – 5.23: “Lian Yu”</li>
</ul>
</div>
</div>
