org-pages/leisure/dc.org
* 2017/2018 [112/112] [100%]

+ [X] Supergirl – 3.01: “Girl of Steel”
+ [X] The Flash – 4.01: “The Flash Reborn”
+ [X] Legends of Tomorrow – 3.01: “Aruba-Con”
+ [X] Arrow – 6.01: “Fallout”
+ [X] Supergirl – 3.02: “Triggers”
+ [X] The Flash – 4.02: “Mixed Signals”
+ [X] Legends of Tomorrow – 3.02: “Freakshow”
+ [X] Arrow – 6.02: “Tribute”
+ [X] Supergirl – 3.03: “Far From The Tree”
+ [X] The Flash – 4.03: “Luck Be A Lady”
+ [X] Legends of Tomorrow – 3.03: “Zari”
+ [X] Arrow – 6.03: “Next of Kin”
+ [X] Supergirl – 3.04: “The Faithful”
+ [X] The Flash – 4.04: “Elongated Journey Into Night”
+ [X] Legends of Tomorrow – 3.04: “Phone Home”
+ [X] Arrow – 6.04: “Reversal”
+ [X] Supergirl – 3.05: “Damage”
+ [X] The Flash – 4.05: “Girls Night Out”
+ [X] Legends of Tomorrow – 3.05: “Return of the Mack”
+ [X] Arrow – 6.05: “Deathstroke Returns”
+ [X] Supergirl – 3.06: “Midvale”
+ [X] The Flash – 4.06: “When Harry Met Harry”
+ [X] Legends of Tomorrow – 3.06: “Helen Hunt”
+ [X] Arrow – 6.06: “Promises Kept”
+ [X] Supergirl – 3.07: “Wake Up”
+ [X] The Flash – 4.07: “Therefore I Am”
+ [X] Legends of Tomorrow – 3.07: “Welcome to the Jungle”
+ [X] Arrow – 6.07: “Thanksgiving”
+ [X] Supergirl – 3.08: “Crisis on Earth-X Part 1” *MUST BE WATCHED TOGETHER (1)*
+ [X] Arrow – 6.08: “Crisis on Earth-X Part 2” *MUST BE WATCHED TOGETHER (2)*
+ [X] The Flash – 4.08: “Crisis on Earth-X Part 3” *MUST BE WATCHED TOGETHER (3)*
+ [X] Legends of Tomorrow – 3.08: “Crisis on Earth-X Part 4” *MUST BE WATCHED TOGETHER (4)*
+ [X] Supergirl – 3.09: “Reign”
+ [X] The Flash – 4.09: “Don’t Run”
+ [X] Legends of Tomorrow – 3.09: “Beebo The God of War”
+ [X] Arrow – 6.09: “Irreconcilable Differences”
+ [X] Freedom Fighters: The Ray - 1.01: "Episode One"
+ [X] Freedom Fighters: The Ray - 1.02: "Episode Two"
+ [X] Freedom Fighters: The Ray - 1.03: "Episode Three"
+ [X] Freedom Fighters: The Ray - 1.04: "Episode Four"
+ [X] Freedom Fighters: The Ray - 1.05: "Episode Five"
+ [X] Freedom Fighters: The Ray - 1.06: "Episode Six"
+ [X] Supergirl – 3.10: “Legion of Super-Heroes”
+ [X] The Flash – 4.10: “The Trial of The Flash”
+ [X] Black Lightning – 1.01: “The Resurrection”
+ [X] Arrow – 6.10: “Divided”
+ [X] Supergirl – 3.11: “Fort Rozz”
+ [X] The Flash – 4.11: “The Elongated Knight Rises”
+ [X] Black Lightning – 1.02: “Lawanda: The Book of Hope”
+ [X] Arrow – 6.11: “We Fall”
+ [X] Supergirl – 3.12: “For Good”
+ [X] The Flash – 4.12: “Honey I Shrunk Team Flash”
+ [X] Black Lightning – 1.03: “Lawanda: The Book of Burial”
+ [X] Arrow – 6.12: “All For Nothing”
+ [X] Supergirl – 3.13: “Both Sides Now”
+ [X] The Flash – 4.13: “True Colors”
+ [X] Black Lightning – 1.04: “Black Jesus”
+ [X] Arrow – 6.13: “The Devil’s Greatest Trick”
+ [X] Legends of Tomorrow – 3.10: “Daddy Darhkest”
+ [X] Black Lightning – 1.05: “And Then the Devil Brought the Plague: The Book of Green Light”
+ [X] Legends of Tomorrow – 3.11: “Here I Go Again”
+ [X] Legends of Tomorrow – 3.12: “The Curse of the Earth Totem”
+ [X] The Flash – 4.14: “Subject 9”
+ [X] Black Lightning – 1.06: “Three Sevens The Book of Thunder”
+ [X] Arrow – 6.14: “Collision Course”
+ [X] Legends of Tomorrow – 3.13: “No Country For Old Dads”
+ [X] The Flash – 4.15: “Enter Flashtime”
+ [X] Black Lightning – 1.07: “Equinox: The Book of Fate”
+ [X] Arrow – 6.15: “Doppelgänger”
+ [X] Legends of Tomorrow – 3.14: “Amazing Grace”
+ [X] The Flash – 4.16: “Run, Iris, Run”
+ [X] Black Lightning – 1.08: “Revelations”
+ [X] Legends of Tomorrow – 3.15: “Necromancing the Stone”
+ [X] Black Lightning – 1.09: “The Book of Little Black Lies”
+ [X] Legends of Tomorrow – 3.16: “I, Ava”
+ [X] Black Lightning – 1.10: “Sins of the Father: The Book of Redemption”
+ [X] Arrow – 6.16: “The Thanatos Guild”
+ [X] Legends of Tomorrow – 3.17: “Guest Starring John Noble”
+ [X] Black Lightning – 1.11: “Black Jesus: The Book of Crucifixion”
+ [X] Arrow – 6.17: “Brothers in Arms”
+ [X] Legends of Tomorrow – 3.18: “The Good, The Bad and The Cuddly”
+ [X] The Flash – 4.17: “Null and Annoyed”
+ [X] Black Lightning – 1.12: “The Resurrection and the Light: The Book of Pain”
+ [X] Arrow – 6.18: “Fundamentals”
+ [X] Supergirl – 3.14: “Schott Through The Heart”
+ [X] The Flash – 4.18: “Lose Yourself”
+ [X] Black Lightning – 1.13: “Shadow of Death: The Book of War”
+ [X] Arrow – 6.19: “The Dragon”
+ [X] Supergirl – 3.15: “In Search of Lost Time”
+ [X] The Flash – 4.19: “Fury Rogue”
+ [X] Arrow – 6.20: “Shifting Allegiances”
+ [X] Supergirl – 3.16: “Of Two Minds”
+ [X] The Flash – 4.20: “Therefore She Is”
+ [X] Arrow – 6.21: “Docket No. 11-19-41-73”
+ [X] Supergirl – 3.17: “Trinity”
+ [X] The Flash – 4.21: “Harry and the Harrisons”
+ [X] Arrow – 6.22: “The Ties That Bind”
+ [X] Supergirl – 3.18: “Shelter From The Storm”
+ [X] The Flash – 4.22: “Think Fast”
+ [X] Arrow – 6.23: “Life Sentence”
+ [X] Supergirl – 3.19: “The Fanatical”
+ [X] The Flash – 4.23: “We Are The Flash”
+ [X] Supergirl – 3.20: “Dark Side of the Moon”
+ [X] Supergirl – 3.21: “Not Kansas”
+ [X] Supergirl – 3.22: “Make It Reign”
+ [X] Supergirl – 3.23: “Battles Lost And Won”
+ [X] Freedom Fighters: The Ray - 2.01: "Episode One"
+ [X] Freedom Fighters: The Ray - 2.02: "Episode Two"
+ [X] Freedom Fighters: The Ray - 2.03: "Episode Three"
+ [X] Freedom Fighters: The Ray - 2.04: "Episode Four"
+ [X] Freedom Fighters: The Ray - 2.05: "Episode Five"
+ [X] Freedom Fighters: The Ray - 2.06: "Episode Six"

