html/org-pages/dc.html

<div id="outline-container-org8e4e498" class="outline-2">
<h2 id="org8e4e498">2017/2018 <code>[112/112]</code> <code>[100%]</code></h2>
<div class="outline-text-2" id="text-org8e4e498">
<ul class="org-ul">
<li class="on"><code>[X]</code> Supergirl – 3.01: “Girl of Steel”</li>
<li class="on"><code>[X]</code> The Flash – 4.01: “The Flash Reborn”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.01: “Aruba-Con”</li>
<li class="on"><code>[X]</code> Arrow – 6.01: “Fallout”</li>
<li class="on"><code>[X]</code> Supergirl – 3.02: “Triggers”</li>
<li class="on"><code>[X]</code> The Flash – 4.02: “Mixed Signals”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.02: “Freakshow”</li>
<li class="on"><code>[X]</code> Arrow – 6.02: “Tribute”</li>
<li class="on"><code>[X]</code> Supergirl – 3.03: “Far From The Tree”</li>
<li class="on"><code>[X]</code> The Flash – 4.03: “Luck Be A Lady”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.03: “Zari”</li>
<li class="on"><code>[X]</code> Arrow – 6.03: “Next of Kin”</li>
<li class="on"><code>[X]</code> Supergirl – 3.04: “The Faithful”</li>
<li class="on"><code>[X]</code> The Flash – 4.04: “Elongated Journey Into Night”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.04: “Phone Home”</li>
<li class="on"><code>[X]</code> Arrow – 6.04: “Reversal”</li>
<li class="on"><code>[X]</code> Supergirl – 3.05: “Damage”</li>
<li class="on"><code>[X]</code> The Flash – 4.05: “Girls Night Out”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.05: “Return of the Mack”</li>
<li class="on"><code>[X]</code> Arrow – 6.05: “Deathstroke Returns”</li>
<li class="on"><code>[X]</code> Supergirl – 3.06: “Midvale”</li>
<li class="on"><code>[X]</code> The Flash – 4.06: “When Harry Met Harry”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.06: “Helen Hunt”</li>
<li class="on"><code>[X]</code> Arrow – 6.06: “Promises Kept”</li>
<li class="on"><code>[X]</code> Supergirl – 3.07: “Wake Up”</li>
<li class="on"><code>[X]</code> The Flash – 4.07: “Therefore I Am”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.07: “Welcome to the Jungle”</li>
<li class="on"><code>[X]</code> Arrow – 6.07: “Thanksgiving”</li>
<li class="on"><code>[X]</code> Supergirl – 3.08: “Crisis on Earth-X Part 1” <b>MUST BE WATCHED TOGETHER (1)</b></li>
<li class="on"><code>[X]</code> Arrow – 6.08: “Crisis on Earth-X Part 2” <b>MUST BE WATCHED TOGETHER (2)</b></li>
<li class="on"><code>[X]</code> The Flash – 4.08: “Crisis on Earth-X Part 3” <b>MUST BE WATCHED TOGETHER (3)</b></li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.08: “Crisis on Earth-X Part 4” <b>MUST BE WATCHED TOGETHER (4)</b></li>
<li class="on"><code>[X]</code> Supergirl – 3.09: “Reign”</li>
<li class="on"><code>[X]</code> The Flash – 4.09: “Don’t Run”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.09: “Beebo The God of War”</li>
<li class="on"><code>[X]</code> Arrow – 6.09: “Irreconcilable Differences”</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 1.01: &ldquo;Episode One&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 1.02: &ldquo;Episode Two&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 1.03: &ldquo;Episode Three&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 1.04: &ldquo;Episode Four&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 1.05: &ldquo;Episode Five&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 1.06: &ldquo;Episode Six&rdquo;</li>
<li class="on"><code>[X]</code> Supergirl – 3.10: “Legion of Super-Heroes”</li>
<li class="on"><code>[X]</code> The Flash – 4.10: “The Trial of The Flash”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.01: “The Resurrection”</li>
<li class="on"><code>[X]</code> Arrow – 6.10: “Divided”</li>
<li class="on"><code>[X]</code> Supergirl – 3.11: “Fort Rozz”</li>
<li class="on"><code>[X]</code> The Flash – 4.11: “The Elongated Knight Rises”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.02: “Lawanda: The Book of Hope”</li>
<li class="on"><code>[X]</code> Arrow – 6.11: “We Fall”</li>
<li class="on"><code>[X]</code> Supergirl – 3.12: “For Good”</li>
<li class="on"><code>[X]</code> The Flash – 4.12: “Honey I Shrunk Team Flash”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.03: “Lawanda: The Book of Burial”</li>
<li class="on"><code>[X]</code> Arrow – 6.12: “All For Nothing”</li>
<li class="on"><code>[X]</code> Supergirl – 3.13: “Both Sides Now”</li>
<li class="on"><code>[X]</code> The Flash – 4.13: “True Colors”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.04: “Black Jesus”</li>
<li class="on"><code>[X]</code> Arrow – 6.13: “The Devil’s Greatest Trick”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.10: “Daddy Darhkest”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.05: “And Then the Devil Brought the Plague: The Book of Green Light”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.11: “Here I Go Again”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.12: “The Curse of the Earth Totem”</li>
<li class="on"><code>[X]</code> The Flash – 4.14: “Subject 9”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.06: “Three Sevens The Book of Thunder”</li>
<li class="on"><code>[X]</code> Arrow – 6.14: “Collision Course”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.13: “No Country For Old Dads”</li>
<li class="on"><code>[X]</code> The Flash – 4.15: “Enter Flashtime”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.07: “Equinox: The Book of Fate”</li>
<li class="on"><code>[X]</code> Arrow – 6.15: “Doppelgänger”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.14: “Amazing Grace”</li>
<li class="on"><code>[X]</code> The Flash – 4.16: “Run, Iris, Run”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.08: “Revelations”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.15: “Necromancing the Stone”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.09: “The Book of Little Black Lies”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.16: “I, Ava”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.10: “Sins of the Father: The Book of Redemption”</li>
<li class="on"><code>[X]</code> Arrow – 6.16: “The Thanatos Guild”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.17: “Guest Starring John Noble”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.11: “Black Jesus: The Book of Crucifixion”</li>
<li class="on"><code>[X]</code> Arrow – 6.17: “Brothers in Arms”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 3.18: “The Good, The Bad and The Cuddly”</li>
<li class="on"><code>[X]</code> The Flash – 4.17: “Null and Annoyed”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.12: “The Resurrection and the Light: The Book of Pain”</li>
<li class="on"><code>[X]</code> Arrow – 6.18: “Fundamentals”</li>
<li class="on"><code>[X]</code> Supergirl – 3.14: “Schott Through The Heart”</li>
<li class="on"><code>[X]</code> The Flash – 4.18: “Lose Yourself”</li>
<li class="on"><code>[X]</code> Black Lightning – 1.13: “Shadow of Death: The Book of War”</li>
<li class="on"><code>[X]</code> Arrow – 6.19: “The Dragon”</li>
<li class="on"><code>[X]</code> Supergirl – 3.15: “In Search of Lost Time”</li>
<li class="on"><code>[X]</code> The Flash – 4.19: “Fury Rogue”</li>
<li class="on"><code>[X]</code> Arrow – 6.20: “Shifting Allegiances”</li>
<li class="on"><code>[X]</code> Supergirl – 3.16: “Of Two Minds”</li>
<li class="on"><code>[X]</code> The Flash – 4.20: “Therefore She Is”</li>
<li class="on"><code>[X]</code> Arrow – 6.21: “Docket No. 11-19-41-73”</li>
<li class="on"><code>[X]</code> Supergirl – 3.17: “Trinity”</li>
<li class="on"><code>[X]</code> The Flash – 4.21: “Harry and the Harrisons”</li>
<li class="on"><code>[X]</code> Arrow – 6.22: “The Ties That Bind”</li>
<li class="on"><code>[X]</code> Supergirl – 3.18: “Shelter From The Storm”</li>
<li class="on"><code>[X]</code> The Flash – 4.22: “Think Fast”</li>
<li class="on"><code>[X]</code> Arrow – 6.23: “Life Sentence”</li>
<li class="on"><code>[X]</code> Supergirl – 3.19: “The Fanatical”</li>
<li class="on"><code>[X]</code> The Flash – 4.23: “We Are The Flash”</li>
<li class="on"><code>[X]</code> Supergirl – 3.20: “Dark Side of the Moon”</li>
<li class="on"><code>[X]</code> Supergirl – 3.21: “Not Kansas”</li>
<li class="on"><code>[X]</code> Supergirl – 3.22: “Make It Reign”</li>
<li class="on"><code>[X]</code> Supergirl – 3.23: “Battles Lost And Won”</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 2.01: &ldquo;Episode One&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 2.02: &ldquo;Episode Two&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 2.03: &ldquo;Episode Three&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 2.04: &ldquo;Episode Four&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 2.05: &ldquo;Episode Five&rdquo;</li>
<li class="on"><code>[X]</code> Freedom Fighters: The Ray - 2.06: &ldquo;Episode Six&rdquo;</li>
</ul>
</div>
</div>
