org-pages/leisure/dc.org
* 2018/2019 [98/98] [100%]

+ [X] The Flash – 5.01: “Nora”
+ [X] Black Lightning – 2.01: “The Book of Consequences: Chapter One: The Rise of the Green Light Babies”
+ [X] Supergirl – 4.01: “American Alien”
+ [X] Arrow – 7.01: “Inmate 4587”
+ [X] The Flash – 5.02: “Blocked”
+ [X] Black Lightning – 2.02: “The Book of Consequences: Chapter Two: Black Jesus Blues”
+ [X] Supergirl – 4.02: “Fallout”
+ [X] Arrow – 7.02: “The Longbow Hunters”
+ [X] Legends of Tomorrow – 4.01: “The Virgin Gary”
+ [X] The Flash – 5.03: “The Death Of Vibe”
+ [X] Black Lightning – 2.03: “The Book of Consequences: Chapter Three: Master Lowry”
+ [X] Supergirl – 4.03: “Man Of Steel”
+ [X] Arrow – 7.03: “Crossing Lines”
+ [X] Legends of Tomorrow – 4.02: “Witch Hunt”
+ [X] The Flash – 5.04: “News Flash”
+ [X] Black Lightning – 2.04: “The Book of Consequences: Chapter Four: Translucent Freak”
+ [X] Supergirl – 4.04: “Ahimsa”
+ [X] Arrow – 7.04: “Level 2”
+ [X] Legends of Tomorrow – 4.03: “Dancing Queen”
+ [X] Supergirl – 4.05: “Parasite Lost”
+ [X] Arrow – 7.05: “The Demon”
+ [X] Legends of Tomorrow – 4.04: “Wet Hot American Bummer”
+ [X] The Flash – 5.05: “All Doll’d Up”
+ [X] Black Lightning – 2.05: “The Book of Blood: Chapter One: Requiem”
+ [X] Supergirl – 4.06: “Call To Action”
+ [X] Arrow – 7.06: “Due Process”
+ [X] Legends of Tomorrow – 4.05: “Tagumo Attacks!!!”
+ [X] The Flash – 5.06: “The Icicle Cometh”
+ [X] Black Lightning – 2.06: “The Book of Blood: Chapter Two - The Perdi”
+ [X] Supergirl – 4.07: “Rather The Fallen Angel”
+ [X] Arrow – 7.07: “The Slabside Redemption”
+ [X] Legends of Tomorrow – 4.06: “Tender Is The Nate”
+ [X] The Flash – 5.07: “O Come, All Ye Thankful”
+ [X] Black Lightning – 2.07: “The Book of Blood: Chapter Three - The Sange”
+ [X] Supergirl – 4.08: “Bunker Hill”
+ [X] Arrow – 7.08: “Unmasked”
+ [X] Legends of Tomorrow – 4.07: “Hell No, Dolly!”
+ [X] The Flash – 5.08: “What’s Past Is Prologue”
+ [X] Black Lightning – 2.08: “The Book of Rebellion: Chapter One: Exodus”
+ [X] The Flash – 5.09: “Elseworlds Part 1” *MUST BE WATCHED TOGETHER (1)*
+ [X] Arrow – 7.09: “Elseworlds Part 2” *MUST BE WATCHED TOGETHER (2)*
+ [X] Supergirl – 4.09: “Elseworlds Part 3” *MUST BE WATCHED TOGETHER (3)*
+ [X] Legends of Tomorrow – 4.08: “Legends Of To-Meow-Meow”
+ [X] Black Lightning – 2.09: “The Book of Rebellion: Chapter Two: Gift Of The Magi”
+ [X] The Flash – 5.10: “The Flash & The Furious”
+ [X] Supergirl – 4.10: “Suspicious Minds”
+ [X] Arrow – 7.10: “My Name Is Emiko Queen”
+ [X] Black Lightning – 2.10: “The Book of Rebellion: Chapter Three: Angelitos Negros”
+ [X] The Flash – 5.11: “Seeing Red”
+ [X] Supergirl – 4.11: “Blood Memory”
+ [X] Arrow – 7.11: “Past Sins”
+ [X] Black Lightning – 2.11: “The Book Of Secrets: Chapter One: Prodigal Son”
+ [X] The Flash – 5.12: “Memorabilia”
+ [X] Arrow – 7.12: “The Emerald Archer”
+ [X] Black Lightning – 2.12: “The Book Of Secrets: Chapter Two: Just and Unjust”
+ [X] The Flash – 5.13: “Goldfaced”
+ [X] Arrow – 7.13: “Star City Slayer”
+ [X] Black Lightning – 2.13: “The Book of Secrets: Chapter Three: Pillar of Fire”
+ [X] The Flash – 5.14: “Cause and XS”
+ [X] Supergirl – 4.12: “Menagerie”
+ [X] Supergirl – 4.13: “What’s So Funny About Truth, Justice, And The American Way?”
+ [X] Arrow – 7.14: “Brothers & Sisters”
+ [X] Black Lightning – 2.14: “The Book of Secrets: Chapter Four: Original Sin”
+ [X] The Flash – 5.15: “King Shark vs Gorilla Grodd”
+ [X] Supergirl – 4.14: “Stand And Deliver”
+ [X] Arrow – 7.15: “Training Day”
+ [X] Black Lightning – 2.15: “The Book Of The Apocalypse: Chapter One: The Alpha”
+ [X] The Flash – 5.16: “Failure Is An Orphan”
+ [X] Supergirl – 4.15: “O Brother, Where Art Though”
+ [X] Arrow – 7.16: “Star City 2040”
+ [X] Black Lightning – 2.16: “The Book Of The Apocalypse: Chapter Two: The Omega”
+ [X] The Flash – 5.17: “Time Bomb”
+ [X] Supergirl – 4.16: “The House Of L”
+ [X] Arrow – 7.17: “Inheritance”
+ [X] Supergirl – 4.17: “All About Eve”
+ [X] Legends of Tomorrow – 4.09: “Lucha de Apuestas”
+ [X] Legends of Tomorrow – 4.10: “The Getaway”
+ [X] Arrow – 7.18: “Lost Canary”
+ [X] Legends of Tomorrow – 4.11: “Séance and Sensibility”
+ [X] The Flash – 5.18: “Godspeed”
+ [X] Supergirl – 4.18: “Crime And Punishment”
+ [X] Arrow – 7.19: “Spartan”
+ [X] Legends of Tomorrow – 4.12: “The Eggplant, The Witch & The Wardrobe”
+ [X] The Flash – 5.19: “Snow Pack”
+ [X] Supergirl – 4.19: “American Dreamer”
+ [X] Arrow – 7.20: “Confessions”
+ [X] Legends of Tomorrow – 4.13: “Egg MacGuffin”
+ [X] The Flash – 5.20: “Gone Rogue”
+ [X] Supergirl – 4.20: “Will The Real Miss Tessmacher Please Stand Up?”
+ [X] Arrow – 7.21: “Living Proof”
+ [X] Legends of Tomorrow – 4.14: “Nip/Stuck”
+ [X] The Flash – 5.21: “The Girl With The Red Lightning”
+ [X] Supergirl – 4.21: “Red Dawn”
+ [X] Arrow – 7.22: “You Have Saved This City”
+ [X] Legends of Tomorrow – 4.15: “Terms Of Service”
+ [X] The Flash – 5.22: “Legacy”
+ [X] Supergirl – 4.22: “The Quest For Peace”
+ [X] Legends of Tomorrow – 4.16: “Hey World!”

