html/org-pages/dc.html

<div id="outline-container-org78bbd7e" class="outline-2">
<h2 id="org78bbd7e">2018/2019 <code>[32/98]</code> <code>[32%]</code></h2>
<div class="outline-text-2" id="text-org78bbd7e">
<ul class="org-ul">
<li class="on"><code>[X]</code> The Flash – 5.01: “Nora”</li>
<li class="on"><code>[X]</code> Black Lightning – 2.01: “The Book of Consequences: Chapter One: The Rise of the Green Light Babies”</li>
<li class="on"><code>[X]</code> Supergirl – 4.01: “American Alien”</li>
<li class="on"><code>[X]</code> Arrow – 7.01: “Inmate 4587”</li>
<li class="on"><code>[X]</code> The Flash – 5.02: “Blocked”</li>
<li class="on"><code>[X]</code> Black Lightning – 2.02: “The Book of Consequences: Chapter Two: Black Jesus Blues”</li>
<li class="on"><code>[X]</code> Supergirl – 4.02: “Fallout”</li>
<li class="on"><code>[X]</code> Arrow – 7.02: “The Longbow Hunters”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 4.01: “The Virgin Gary”</li>
<li class="on"><code>[X]</code> The Flash – 5.03: “The Death Of Vibe”</li>
<li class="on"><code>[X]</code> Black Lightning – 2.03: “The Book of Consequences: Chapter Three: Master Lowry”</li>
<li class="on"><code>[X]</code> Supergirl – 4.03: “Man Of Steel”</li>
<li class="on"><code>[X]</code> Arrow – 7.03: “Crossing Lines”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 4.02: “Witch Hunt”</li>
<li class="on"><code>[X]</code> The Flash – 5.04: “News Flash”</li>
<li class="on"><code>[X]</code> Black Lightning – 2.04: “The Book of Consequences: Chapter Four: Translucent Freak”</li>
<li class="on"><code>[X]</code> Supergirl – 4.04: “Ahimsa”</li>
<li class="on"><code>[X]</code> Arrow – 7.04: “Level 2”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 4.03: “Dancing Queen”</li>
<li class="on"><code>[X]</code> Supergirl – 4.05: “Parasite Lost”</li>
<li class="on"><code>[X]</code> Arrow – 7.05: “The Demon”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 4.04: “Wet Hot American Bummer”</li>
<li class="on"><code>[X]</code> The Flash – 5.05: “All Doll’d Up”</li>
<li class="on"><code>[X]</code> Black Lightning – 2.05: “The Book of Blood: Chapter One: Requiem”</li>
<li class="on"><code>[X]</code> Supergirl – 4.06: “Call To Action”</li>
<li class="on"><code>[X]</code> Arrow – 7.06: “Due Process”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 4.05: “Tagumo Attacks!!!”</li>
<li class="on"><code>[X]</code> The Flash – 5.06: “The Icicle Cometh”</li>
<li class="on"><code>[X]</code> Black Lightning – 2.06: “The Book of Blood: Chapter Two - The Perdi”</li>
<li class="on"><code>[X]</code> Supergirl – 4.07: “Rather The Fallen Angel”</li>
<li class="on"><code>[X]</code> Arrow – 7.07: “The Slabside Redemption”</li>
<li class="on"><code>[X]</code> Legends of Tomorrow – 4.06: “Tender Is The Nate”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.07: “O Come, All Ye Thankful”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.07: “The Book of Blood: Chapter Three - The Sange”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.08: “Bunker Hill”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.08: “Unmasked”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.07: “Hell No, Dolly!”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.08: “What’s Past Is Prologue”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.08: “The Book of Rebellion: Chapter One: Exodus”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.09: “Elseworlds Part 1” <b>MUST BE WATCHED TOGETHER (1)</b></li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.09: “Elseworlds Part 2” <b>MUST BE WATCHED TOGETHER (2)</b></li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.09: “Elseworlds Part 3” <b>MUST BE WATCHED TOGETHER (3)</b></li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.08: “Legends Of To-Meow-Meow”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.09: “The Book of Rebellion: Chapter Two: Gift Of The Magi”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.10: “The Flash &amp; The Furious”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.10: “Suspicious Minds”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.10: “My Name Is Emiko Queen”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.10: “The Book of Rebellion: Chapter Three: Angelitos Negros”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.11: “Seeing Red”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.11: “Blood Memory”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.11: “Past Sins”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.11: “The Book Of Secrets: Chapter One: Prodigal Son”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.12: “Memorabilia”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.12: “The Emerald Archer”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.12: “The Book Of Secrets: Chapter Two: Just and Unjust”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.13: “Goldfaced”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.13: “Star City Slayer”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.13: “The Book of Secrets: Chapter Three: Pillar of Fire”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.14: “Cause and XS”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.12: “Menagerie”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.13: “What’s So Funny About Truth, Justice, And The American Way?”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.14: “Brothers &amp; Sisters”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.14: “The Book of Secrets: Chapter Four: Original Sin”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.15: “King Shark vs Gorilla Grodd”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.14: “Stand And Deliver”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.15: “Training Day”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.15: “The Book Of The Apocalypse: Chapter One: The Alpha”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.16: “Failure Is An Orphan”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.15: “O Brother, Where Art Though”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.16: “Star City 2040”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 2.16: “The Book Of The Apocalypse: Chapter Two: The Omega”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.17: “Time Bomb”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.16: “The House Of L”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.17: “Inheritance”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.17: “All About Eve”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.09: “Lucha de Apuestas”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.10: “The Getaway”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.18: “Lost Canary”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.11: “Séance and Sensibility”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.18: “Godspeed”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.18: “Crime And Punishment”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.19: “Spartan”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.12: “The Eggplant, The Witch &amp; The Wardrobe”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.19: “Snow Pack”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.19: “American Dreamer”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.20: “Confessions”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.13: “Egg MacGuffin”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.20: “Gone Rogue”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.20: “Will The Real Miss Tessmacher Please Stand Up?”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.21: “Living Proof”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.14: “Nip/Stuck”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.21: “The Girl With The Red Lightning”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.21: “Red Dawn”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 7.22: “You Have Saved This City”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.15: “Terms Of Service”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 5.22: “Legacy”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 4.22: “The Quest For Peace”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 4.16: “Hey World!”</li>
</ul>
</div>
</div>
