org-pages/leisure/dc.org
* 2019/2020 [66/112] [58%]

+ [X] Batwoman – 1.01: “Pilot”
+ [X] Supergirl – 5.01: “Event Horizon”
+ [X] Black Lightning – 3.01: “The Book Of Occupation: Chapter One: Birth of Blackbird”
+ [X] The Flash – 6.01: “Into The Void”
+ [X] Batwoman – 1.02: “The Rabbit Hole”
+ [X] Supergirl – 5.02: “Stranger Beside Me”
+ [X] Black Lightning – 3.02: “The Book Of Occupation: Chapter Two”
+ [X] The Flash – 6.02: “A Flash Of Lightning”
+ [X] Arrow – 8.01: “Starling City”
+ [X] Batwoman – 1.03: “Down Down Down”
+ [X] Supergirl – 5.03: “Blurred Lines”
+ [X] Black Lightning – 3.03: “The Book Of Occupation: Chapter Three:  Agent Odell's Pipe-Dream”
+ [X] The Flash – 6.03: “Dead Man Running”
+ [X] Arrow – 8.02: “Welcome To Hong Kong”
+ [X] Batwoman – 1.04: “Who Are You”
+ [X] Supergirl – 5.04: “In Plain Sight”
+ [X] Black Lightning – 3.04: “The Book Of Occupation: Chapter Four: Lynn’s Ouroboros”
+ [X] The Flash – 6.04: “There Will Be Blood”
+ [X] Arrow – 8.03: “Leap Of Faith”
+ [X] Batwoman – 1.05: “Mine Is A Long Sad Tale”
+ [X] Supergirl – 5.05: “Dangerous Liaisons”
+ [X] The Flash – 6.05: “Kiss Kiss Breach Breach”
+ [X] Arrow – 8.04: “Present Tense”
+ [X] Batwoman – 1.06: “I’ll Be Judge, I’ll Be Jury”
+ [X] Supergirl – 5.06: “Confidence Women”
+ [X] Black Lightning – 3.05: “The Book Of Occupation: Chapter Five: Requiem For Tavon”
+ [X] Batwoman – 1.07: “Tell Me The Truth”
+ [X] Supergirl – 5.07: “Tremors”
+ [X] Black Lightning – 3.06: “The Book Of Resistance: Chapter Six:”
+ [X] The Flash – 6.06: “License To Elongate”
+ [X] Arrow – 8.05: “Prochnost”
+ [X] Black Lightning – 3.07: “The Book Of Resistance: Chapter Two: Henderson’s Opus”
+ [X] The Flash – 6.07: “The Last Temptation Of Barry Allen, Pt 1”
+ [X] Arrow – 8.06: “Reset”
+ [X] Batwoman – 1.08: “A Mad Tea Party”
+ [X] Supergirl – 5.08: “The Wrath Of Rama Khan”
+ [X] Black Lightning – 3.08: “The Book Of Resistance: Chapter Three: Battle of Franklin Terrace”
+ [X] The Flash – 6.08: “The Last Temptation Of Barry Allen, Pt 2”
+ [X] Arrow – 8.07: “Purgatory”
+ [X] Supergirl – 5.09: “Crisis On Infinite Earths Part 1” *MUST WATCH TOGETHER*
+ [X] Batwoman – 1.09: “Crisis On Infinite Earths Part 2” *MUST WATCH TOGETHER*
+ [X] Black Lightning – 3.09: “The Book Of Resistance: Chapter Four: Earth Crisis” *MUST WATCH TOGETHER*
+ [X] The Flash – 6.09: “Crisis On Infinite Earths Part 3” *MUST WATCH TOGETHER*
+ [X] Arrow – 8.08: “Crisis On Infinite Earths Part 4” *MUST WATCH TOGETHER*
+ [X] Legends of Tomorrow – 5.01: “Crisis On Infinite Earths Part 5” *MUST WATCH TOGETHER*
+ [X] Batwoman – 1.10: “How Queer Everything Is Today!”
+ [X] Supergirl – 5.10: “The Bottle Episode”
+ [X] Black Lightning – 3.10: “The Book Of Markovia: Chapter One: Blessings and Curses Reborn”
+ [X] Arrow – 8.09: “Green Arrow & The Canaries”
+ [X] Legends of Tomorrow – 5.02: “Meet The Legends”
+ [X] Batwoman – 1.11: “An Un-birthday Present”
+ [X] Supergirl – 5.11: “Back From The Future – Part One”
+ [X] Black Lightning – 3.11: “The Book Of Markovia: Chapter Two: Lynn’s Addiction ”
+ [X] Arrow – 8.10: “Fadeout”
+ [X] Black Lightning – 3.12: “The Book Of Markovia: Chapter Three: Motherless ID”
+ [X] The Flash – 6.10: “Marathon”
+ [X] Legends of Tomorrow – 5.03: “Miss Me, Kiss Me, Love Me”
+ [X] Black Lightning – 3.13: “The Book Of Markovia: Chapter Four: Grab The Strap”
+ [X] The Flash – 6.11: “Love Is A Battlefield”
+ [X] Legends of Tomorrow – 5.04: “Slay Anything”
+ [X] Batwoman – 1.12: “Take Your Choice”
+ [X] Supergirl – 5.12: “Back From The Future – Part Two”
+ [X] The Flash – 6.12: “A Girl Named Sue”
+ [X] Legends of Tomorrow – 5.05: “A Head Of Her Time”
+ [X] Batwoman – 1.13: “Drink Me”
+ [X] Supergirl – 5.13: “A Super Life”
+ [ ] Black Lightning – 3.14: “The Book Of War: Chapter One: Homecoming”
+ [ ] The Flash – 6.13: “Grodd Friended Me”
+ [ ] Legends of Tomorrow – 5.06: “Mortal Khanbat”
+ [ ] Black Lightning – 3.15: “The Book Of War: Chapter Two: Freedom Ain’t Free”
+ [ ] Batwoman – 1.14: “Grinning From Ear To Ear”
+ [ ] Supergirl – 5.14: “The Bodyguard”
+ [ ] Black Lightning – 3.16: “The Book Of War: Chapter Three: Liberation”
+ [ ] The Flash – 6.14: “Death Of The Speed Force”
+ [ ] Legends of Tomorrow – 5.07: “Mr. Parker’s Cul-De-Sac”
+ [ ] Batwoman – 1.15: “Off With Her Head”
+ [ ] Supergirl – 5.15: “Reality Bytes”
+ [ ] The Flash – 6.15: “The Exorcism of Nash Wells”
+ [ ] Legends of Tomorrow – 5.08: “Romeo V. Juliet: Dawn of Justness”
+ [ ] Batwoman – 1.16: “Through The Looking Glass”
+ [ ] Supergirl – 5.16: “Alex In Wonderland”
+ [ ] The Flash – 6.16: “So Long and Goodnight”
+ [ ] Legends of Tomorrow – 5.09: “Zari, Not Zari”
+ [ ] Batwoman – 1.17: “A Narrow Escape”
+ [ ] The Flash – 6.17: “Liberation”
+ [ ] Legends of Tomorrow – 5.10: “The Great British Fake Off”
+ [ ] Batwoman – 1.18: “If You Believe In Me, I’ll Believe In You”
+ [ ] Supergirl – 5.17: “Deus Ex Machina”
+ [ ] The Flash – 6.18: “Pay The Piper”
+ [ ] Legends of Tomorrow – 5.11: “Ship Broken”
+ [ ] Batwoman – 1.19: “A Secret Kept From All The Rest”
+ [ ] Supergirl – 5.18: “The Missing Link”
+ [ ] The Flash – 6.19: “Success Is Assured”
+ [ ] Legends of Tomorrow – 5.12: “Freaks and Greeks”
+ [ ] Batwoman – 1.20: “O, Mouse!”
+ [ ] Supergirl – 5.19: “Immortal Kombat”
+ [ ] Stargirl – 1.01: “Pilot”
+ [ ] Legends of Tomorrow – 5.13: “I Am Legends”
+ [ ] Stargirl – 1.02: “S.T.R.I.P.E.”
+ [ ] Legends of Tomorrow – 5.14: “The One Where We’re Stuck On TV”
+ [ ] Stargirl – 1.03: “Icicle”
+ [ ] Legends of Tomorrow – 5.15: “Swan Thong”
+ [ ] Stargirl – 1.04: “Wildcat”
+ [ ] Stargirl – 1.05: “Hourman and Dr. Mid-Nite ”
+ [ ] Stargirl – 1.06: “The Justice Society”
+ [ ] Stargirl – 1.07: “Shiv Part One”
+ [ ] Stargirl – 1.08: “Shiv Part Two”
+ [ ] Stargirl – 1.09: “Brainwave”
+ [ ] Stargirl – 1.10: “Brainwave Jr.”
+ [ ] Stargirl – 1.11: “Shining Knight”
+ [ ] Stargirl – 1.12: “Stars & S.T.R.I.P.E Part One”
+ [ ] Stargirl – 1.13: “Stars & S.T.R.I.P.E Part Two”

