html/org-pages/dc.html

<div id="outline-container-orgdc7e633" class="outline-2">
<h2 id="orgdc7e633">2019/2020 <code>[0/112]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-orgdc7e633">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.01: “Pilot”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.01: “Event Horizon”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.01: “The Book Of Occupation: Chapter One: Birth of Blackbird”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.01: “Into The Void”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.02: “The Rabbit Hole”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.02: “Stranger Beside Me”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.02: “The Book Of Occupation: Chapter Two”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.02: “A Flash Of Lightning”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.01: “Starling City”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.03: “Down Down Down”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.03: “Blurred Lines”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.03: “The Book Of Occupation: Chapter Three:  Agent Odell&rsquo;s Pipe-Dream”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.03: “Dead Man Running”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.02: “Welcome To Hong Kong”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.04: “Who Are You”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.04: “In Plain Sight”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.04: “The Book Of Occupation: Chapter Four: Lynn’s Ouroboros”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.04: “There Will Be Blood”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.03: “Leap Of Faith”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.05: “Mine Is A Long Sad Tale”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.05: “Dangerous Liaisons”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.05: “Kiss Kiss Breach Breach”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.04: “Present Tense”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.06: “I’ll Be Judge, I’ll Be Jury”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.06: “Confidence Women”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.05: “The Book Of Occupation: Chapter Five: Requiem For Tavon”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.07: “Tell Me The Truth”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.07: “Tremors”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.06: “The Book Of Resistance: Chapter Six:”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.06: “License To Elongate”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.05: “Prochnost”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.07: “The Book Of Resistance: Chapter Two: Henderson’s Opus”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.07: “The Last Temptation Of Barry Allen, Pt 1”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.06: “Reset”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.08: “A Mad Tea Party”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.08: “The Wrath Of Rama Khan”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.08: “The Book Of Resistance: Chapter Three: Battle of Franklin Terrace”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.08: “The Last Temptation Of Barry Allen, Pt 2”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.07: “Purgatory”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.09: “Crisis On Infinite Earths Part 1” ***MUST WATCH TOGETHER</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.09: “Crisis On Infinite Earths Part 2” ***MUST WATCH TOGETHER</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.09: “The Book Of Resistance: Chapter Four: Earth Crisis”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.09: “Crisis On Infinite Earths Part 3” ***MUST WATCH TOGETHER</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.08: “Crisis On Infinite Earths Part 4” ***MUST WATCH TOGETHER</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.01: “Crisis On Infinite Earths Part 5” **MUST WATCH TOGETHER</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.10: “How Queer Everything Is Today!”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.10: “The Bottle Episode”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.10: “The Book Of Markovia: Chapter One: Blessings and Curses Reborn”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.09: “Green Arrow &amp; The Canaries”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.02: “Meet The Legends”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.11: “An Un-birthday Present”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.11: “Back From The Future – Part One”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.11: “The Book Of Markovia: Chapter Two: Lynn’s Addiction ”</li>
<li class="off"><code>[&#xa0;]</code> Arrow – 8.10: “Fadeout”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.12: “The Book Of Markovia: Chapter Three: Motherless ID”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.10: “Marathon”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.03: “Miss Me, Kiss Me, Love Me”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.13: “The Book Of Markovia: Chapter Four: Grab The Strap”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.11: “Love Is A Battlefield”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.04: “Slay Anything”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.12: “Take Your Choice”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.12: “Back From The Future – Part Two”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.12: “A Girl Named Sue”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.05: “A Head Of Her Time”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.13: “Drink Me”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.13: “A Super Life”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.14: “The Book Of War: Chapter One: Homecoming”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.13: “Grodd Friended Me”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.06: “Mortal Khanbat”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.15: “The Book Of War: Chapter Two: Freedom Ain’t Free”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.14: “Grinning From Ear To Ear”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.14: “The Bodyguard”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 3.16: “The Book Of War: Chapter Three: Liberation”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.14: “Death Of The Speed Force”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.07: “Mr. Parker’s Cul-De-Sac”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.15: “Off With Her Head”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.15: “Reality Bytes”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.15: “The Exorcism of Nash Wells”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.08: “Romeo V. Juliet: Dawn of Justness”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.16: “Through The Looking Glass”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.16: “Alex In Wonderland”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.16: “So Long and Goodnight”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.09: “Zari, Not Zari”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.17: “A Narrow Escape”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.17: “Liberation”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.10: “The Great British Fake Off”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.18: “If You Believe In Me, I’ll Believe In You”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.17: “Deus Ex Machina”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.18: “Pay The Piper”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.11: “Ship Broken”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.19: “A Secret Kept From All The Rest”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.18: “The Missing Link”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 6.19: “Success Is Assured”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.12: “Freaks and Greeks”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 1.20: “O, Mouse!”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 5.19: “Immortal Kombat”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.01: “Pilot”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.13: “I Am Legends”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.02: “S.T.R.I.P.E.”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.14: “The One Where We’re Stuck On TV”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.03: “Icicle”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 5.15: “Swan Thong”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.04: “Wildcat”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.05: “Hourman and Dr. Mid-Nite ”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.06: “The Justice Society”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.07: “Shiv Part One”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.08: “Shiv Part Two”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.09: “Brainwave”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.10: “Brainwave Jr.”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.11: “Shining Knight”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.12: “Stars &amp; S.T.R.I.P.E Part One”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 1.13: “Stars &amp; S.T.R.I.P.E Part Two”</li>
</ul>
</div>
</div>
