org-pages/leisure/dc.org
* 2020/2021 [0/104] [0%]

+ [ ] Batwoman – 2.01: “What Happened To Kate Kane”
+ [ ] Batwoman – 2.02: “Prior Criminal History”
+ [ ] Batwoman – 2.03: “Bat Girl Magic!”
+ [ ] Black Lightning – 4.01: “The Book of Reconstruction: Chapter One”
+ [ ] Batwoman – 2.04: “Fair Skin, Blue Eyes”
+ [ ] Black Lightning – 4.02: “The Book of Reconstruction: Chapter Two”
+ [ ] Batwoman – 2.05: “Gore On Canvas”
+ [ ] Black Lightning – 4.03: “The Book of Reconstruction: Chapter Three”
+ [ ] Superman & Lois – 1.01: “Pilot”
+ [ ] Batwoman – 2.06: “Do Not Resuscitate”
+ [ ] Black Lightning – 4.04: “The Book of Reconstruction: Chapter Four”
+ [ ] The Flash – 7.01: “All’s Wells That Ends Wells”
+ [ ] Superman & Lois – 1.02: “Heritage”
+ [ ] Black Lightning – 4.05: “The Book of Ruin: Chapter One”
+ [ ] The Flash – 7.02: “The Speed of Thought”
+ [ ] Superman & Lois – 1.03: “The Perks of Not Being a Wallflower”
+ [ ] Batwoman – 2.07: “It’s Best You Stop Digging”
+ [ ] Black Lightning – 4.06: “The Book of Ruin: Chapter Two”
+ [ ] The Flash – 7.02: “Mother”
+ [ ] Superman & Lois – 1.04: “Haywire”
+ [ ] Batwoman – 2.08: “Survived Much Worse”
+ [ ] The Flash – 7.04: “Central City Strong”
+ [ ] Superman & Lois – 1.05: “The Best of Smallville”
+ [ ] Batwoman – 2.09: “Rule #1”
+ [ ] The Flash – 7.05: “Fear Me”
+ [ ] Supergirl – 6.01: “Rebirth”
+ [ ] The Flash – 7.06: “The One With The Nineties”
+ [ ] Supergirl – 6.02: “A Few Good Women”
+ [ ] Batwoman – 2.10: “Time Off For Good Behavior”
+ [ ] Black Lightning – 4.07: “Painkiller”
+ [ ] The Flash – 7.07: “Growing Pains”
+ [ ] Supergirl – 6.03: “Phantom Menaces”
+ [ ] Batwoman – 2.11: “Arrive Alive”
+ [ ] Black Lightning – 4.08: “The Book of Ruin: Chapter Three”
+ [ ] Supergirl – 6.04: “Lost Souls”
+ [ ] Black Lightning – 4.09: “The Book of Ruin: Chapter Four”
+ [ ] Supergirl – 6.05: “Prom Night”
+ [ ] Legends of Tomorrow – 6.01: “Ground Control to Sara Lance”
+ [ ] Batwoman – 2.12: “Initiate Self Destruct”
+ [ ] Black Lightning – 4.10: “The Book of Reunification: Chapter One”
+ [ ] The Flash – 7.08: “The People v. Killer Frost”
+ [ ] Supergirl – 6.06: “Prom Again!”
+ [ ] Legends of Tomorrow – 6.02: “Meat: The Legends”
+ [ ] Batwoman – 2.13: “I'll Give You A Clue”
+ [ ] Black Lightning – 4.11: “The Book of Reunification: Chapter Two”
+ [ ] The Flash – 7.09: “Timeless”
+ [ ] Supergirl – 6.07: “Fear Knot”
+ [ ] Legends of Tomorrow – 6.03: “The Ex-Factor”
+ [ ] Batwoman – 2.14: “And Justice For All”
+ [ ] Black Lightning – 4.12: “The Book of Resurrection: Chapter One”
+ [ ] The Flash – 7.10: “Family Matters Part 1”
+ [ ] Superman & Lois – 1.06: “Broken Trust”
+ [ ] Legends of Tomorrow – 6.04: “Bay of Squids”
+ [ ] Black Lightning – 4.13: “The Book of Resurrection: Chapter Two” (Series Finale)
+ [ ] The Flash – 7.11: “Family Matters Part 2”
+ [ ] Superman & Lois – 1.07: “Man of Steel”
+ [ ] Superman & Lois – 1.08: “Holding The Wrench”
+ [ ] Legends of Tomorrow – 6.05: “The Satanist's Apprentice”
+ [ ] Batwoman – 2.15: “Armed and Dangerous”
+ [ ] The Flash – 7.12: “Good-Bye Vibrations”
+ [ ] Superman & Lois – 1.09: “Loyal Subjekts”
+ [ ] Legends of Tomorrow – 6.06: “Bishop's Gambit”
+ [ ] Batwoman – 2.16: “Rebirth”
+ [ ] The Flash – 7.13: “Masquerade”
+ [ ] Superman & Lois – 1.10: “O Mother, Where Art Thou?”
+ [ ] Legends of Tomorrow – 6.07: “Back to the Finale: Part II”
+ [ ] Batwoman – 2.17: “Kane, Kate”
+ [ ] The Flash – 7.14: “Rayo de Luz”
+ [ ] Superman & Lois – 1.11: “A Brief Reminiscence In-Between Cataclysmic Events”
+ [ ] Legends of Tomorrow – 6.08: “Stressed Western”
+ [ ] Batwoman – 2.18: “Power”
+ [ ] The Flash – 7.15: “Enemy At The Gates”
+ [ ] The Flash – 7.16: “P.O.W.”
+ [ ] Legends of Tomorrow – 6.09: “This Is Gus”
+ [ ] The Flash – 7.17: “Heart Of The Matter, Part 1”
+ [ ] Superman & Lois – 1.12: “Through The Valley Of Death”
+ [ ] Legends of Tomorrow – 6.10: “Bad Blood”
+ [ ] The Flash – 7.18: “Heart Of The Matter, Part 2”
+ [ ] Superman & Lois – 1.13: “Fail Safe”
+ [ ] Legends of Tomorrow – 6.11: “The Final Frame”
+ [ ] Stargirl – 2.01: “Summer School: Chapter One”
+ [ ] Superman & Lois – 1.14: “The Eradicator”
+ [ ] Legends of Tomorrow – 6.12: “Bored On Board Onboard”
+ [ ] Stargirl – 2.02: “Summer School: Chapter Two”
+ [ ] Superman & Lois – 1.15: “Last Sons of Krypton”
+ [ ] Legends of Tomorrow – 6.13: “Silence of the Sonograms”
+ [ ] Stargirl – 2.03: “Summer School: Chapter Three”
+ [ ] Supergirl – 6.08: “Welcome Back, Kara”
+ [ ] Legends of Tomorrow – 6.14: “There Will Be Brood”
+ [ ] Stargirl – 2.04: “Summer School: Chapter Four”
+ [ ] Supergirl – 6.09: “Dream Weaver”
+ [ ] Legends of Tomorrow – 6.15: “The Fungus Amongus”
+ [ ] Stargirl – 2.05: “Summer School: Chapter Five”
+ [ ] Supergirl – 6.10: “Still I Rise”
+ [ ] Stargirl – 2.06: “Summer School: Chapter Six”
+ [ ] Supergirl – 6.11: “Mxy In The Middle”
+ [ ] Stargirl – 2.07: “Summer School: Chapter Seven”
+ [ ] Supergirl – 6.12: “Blind Spots”
+ [ ] Stargirl – 2.08: “Summer School: Chapter Eight”
+ [ ] Supergirl – 6.13: “The Gauntlet”
+ [ ] Stargirl – 2.09: “Summer School: Chapter Nine”
+ [ ] Supergirl – 6.14: “Magical Thinking”
+ [ ] Stargirl - 2.10: "Summer School: Chapter Ten"
+ [ ] Supergirl - 6.15: "Hope for Tomorrow"

