html/org-pages/dc.html

<div id="outline-container-org1f77a1c" class="outline-2">
<h2 id="org1f77a1c">2020/2021 <code>[0/104]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-org1f77a1c">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.01: “What Happened To Kate Kane”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.02: “Prior Criminal History”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.03: “Bat Girl Magic!”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.01: “The Book of Reconstruction: Chapter One”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.04: “Fair Skin, Blue Eyes”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.02: “The Book of Reconstruction: Chapter Two”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.05: “Gore On Canvas”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.03: “The Book of Reconstruction: Chapter Three”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.01: “Pilot”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.06: “Do Not Resuscitate”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.04: “The Book of Reconstruction: Chapter Four”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.01: “All’s Wells That Ends Wells”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.02: “Heritage”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.05: “The Book of Ruin: Chapter One”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.02: “The Speed of Thought”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.03: “The Perks of Not Being a Wallflower”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.07: “It’s Best You Stop Digging”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.06: “The Book of Ruin: Chapter Two”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.02: “Mother”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.04: “Haywire”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.08: “Survived Much Worse”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.04: “Central City Strong”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.05: “The Best of Smallville”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.09: “Rule #1”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.05: “Fear Me”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.01: “Rebirth”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.06: “The One With The Nineties”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.02: “A Few Good Women”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.10: “Time Off For Good Behavior”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.07: “Painkiller”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.07: “Growing Pains”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.03: “Phantom Menaces”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.11: “Arrive Alive”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.08: “The Book of Ruin: Chapter Three”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.04: “Lost Souls”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.09: “The Book of Ruin: Chapter Four”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.05: “Prom Night”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.01: “Ground Control to Sara Lance”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.12: “Initiate Self Destruct”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.10: “The Book of Reunification: Chapter One”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.08: “The People v. Killer Frost”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.06: “Prom Again!”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.02: “Meat: The Legends”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.13: “I&rsquo;ll Give You A Clue”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.11: “The Book of Reunification: Chapter Two”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.09: “Timeless”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.07: “Fear Knot”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.03: “The Ex-Factor”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.14: “And Justice For All”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.12: “The Book of Resurrection: Chapter One”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.10: “Family Matters Part 1”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.06: “Broken Trust”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.04: “Bay of Squids”</li>
<li class="off"><code>[&#xa0;]</code> Black Lightning – 4.13: “The Book of Resurrection: Chapter Two” (Series Finale)</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.11: “Family Matters Part 2”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.07: “Man of Steel”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.08: “Holding The Wrench”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.05: “The Satanist&rsquo;s Apprentice”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.15: “Armed and Dangerous”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.12: “Good-Bye Vibrations”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.09: “Loyal Subjekts”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.06: “Bishop&rsquo;s Gambit”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.16: “Rebirth”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.13: “Masquerade”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.10: “O Mother, Where Art Thou?”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.07: “Back to the Finale: Part II”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.17: “Kane, Kate”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.14: “Rayo de Luz”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.11: “A Brief Reminiscence In-Between Cataclysmic Events”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.08: “Stressed Western”</li>
<li class="off"><code>[&#xa0;]</code> Batwoman – 2.18: “Power”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.15: “Enemy At The Gates”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.16: “P.O.W.”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.09: “This Is Gus”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.17: “Heart Of The Matter, Part 1”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.12: “Through The Valley Of Death”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.10: “Bad Blood”</li>
<li class="off"><code>[&#xa0;]</code> The Flash – 7.18: “Heart Of The Matter, Part 2”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.13: “Fail Safe”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.11: “The Final Frame”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.01: “Summer School: Chapter One”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.14: “The Eradicator”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.12: “Bored On Board Onboard”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.02: “Summer School: Chapter Two”</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois – 1.15: “Last Sons of Krypton”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.13: “Silence of the Sonograms”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.03: “Summer School: Chapter Three”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.08: “Welcome Back, Kara”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.14: “There Will Be Brood”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.04: “Summer School: Chapter Four”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.09: “Dream Weaver”</li>
<li class="off"><code>[&#xa0;]</code> Legends of Tomorrow – 6.15: “The Fungus Amongus”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.05: “Summer School: Chapter Five”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.10: “Still I Rise”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.06: “Summer School: Chapter Six”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.11: “Mxy In The Middle”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.07: “Summer School: Chapter Seven”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.12: “Blind Spots”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.08: “Summer School: Chapter Eight”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.13: “The Gauntlet”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl – 2.09: “Summer School: Chapter Nine”</li>
<li class="off"><code>[&#xa0;]</code> Supergirl – 6.14: “Magical Thinking”</li>
<li class="off"><code>[&#xa0;]</code> Stargirl - 2.10: &ldquo;Summer School: Chapter Ten&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Supergirl - 6.15: &ldquo;Hope for Tomorrow&rdquo;</li>
</ul>
</div>
</div>
