org-pages/leisure/dc.org
* 2021/2022 [0/41] [0%]

+ [ ] Batwoman - 3.01: "Mad As a Hatter"
+ [ ] DC's Legends of Tomorrow - 7.01: "The Bullet Blondes"
+ [ ] Stargirl - 2.11: "Summer School: Chapter Eleven"
+ [ ] Supergirl - 6.16: "Nightmare in National City"
+ [ ] Batwoman - 3.02: "Loose Tooth"
+ [ ] DC's Legends of Tomorrow - 7.02: "The Need for Speed"
+ [ ] Stargirl - 2.12: "Summer School: Chapter Twelve"
+ [ ] Supergirl - 6.17: "I Believe in a thing Called Love"
+ [ ] Batwoman - 3.03: "Freeze"
+ [ ] DC's Legends of Tomorrow - 7.03: "wvrdr_error_100 not found"
+ [ ] Stargirl - 2.13: "Summer School: Chapter Thirteen"
+ [ ] Supergirl - 6.18: "Truth or Consequences"
+ [ ] Batwoman - 3.04: "Antifreeze"
+ [ ] DC's Legends of Tomorrow - 7.04: "Speakeasy Does It"
+ [ ] Supergirl - 6.19: "The Last Gauntlet"
+ [ ] Supergirl - 6.20: "Kara"
+ [ ] Batwoman - 3.05: "A Lesson From Professor Pyg"
+ [ ] DC's Legends of Tomorrow - 7.05: "It's a Mad, Mad, Mad, Mad Scientist"
+ [ ] The Flash - 8.01: "Armageddon, Part 1"
+ [ ] Batwoman - 3.06: "How Does Your Garden Grow?""
+ [ ] DC's Legends of Tomorrow - 7.06: "Deus Ex Latrina"
+ [ ] The Flash - 8.02: "Armageddon, Part 2"
+ [ ] Batwoman - 3.07: "Pick Your Poison"
+ [ ] DC's Legends of Tomorrow - 7.07: "A Woman's Place Is The War Effort!"
+ [ ] The Flash - 8.03: "Armageddon, Part 3"
+ [ ] The Flash - 8.04: "Armageddon, Part 4"
+ [ ] The Flash - 8.05: "Armageddon, Part 5"
+ [ ] Superman & Lois - 2.01: "What Lies Beneath"
+ [ ] Batwoman - 3.08: "Trust Destiny"
+ [ ] DC's Legends of Tomorrow - 7.08: "Paranoid Android"
+ [ ] Superman & Lois - 2.02: "The Ties That Bind"
+ [ ] Batwoman - 3.09: "Meet Your Maker"
+ [ ] DC's Legends of Tomorrow - 7.09: "Lowest Common Denominator"
+ [ ] Superman & Lois - 2.03: "The Thing in the Mines"
+ [ ] Batwoman - 3.10: "Toxic"
+ [ ] DC's Legends of Tomorrow - 7.10: "The Fixed Point"
+ [ ] Superman & Lois - 2.04: "The Inverse Method"
+ [ ] Batwoman - 3.11: "Broken Toys"
+ [ ] DC's Legends of Tomorrow - 7.11: "Rage Against The Machines"
+ [ ] Superman & Lois - 2.05: "Girl... You'll Be a Woman, Soon"
+ [ ] The Flash - 8.06: "Impulsive Excessive Disorder"
+ [ ] The Flash - 8.07: "Lockdown"
