html/org-pages/dc.html

<div id="outline-container-orgfb2d957" class="outline-2">
<h2 id="orgfb2d957">2021/2022 <code>[0/41]</code> <code>[0%]</code></h2>
<div class="outline-text-2" id="text-orgfb2d957">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.01: &ldquo;Mad As a Hatter&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.01: &ldquo;The Bullet Blondes&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Stargirl - 2.11: &ldquo;Summer School: Chapter Eleven&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Supergirl - 6.16: &ldquo;Nightmare in National City&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.02: &ldquo;Loose Tooth&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.02: &ldquo;The Need for Speed&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Stargirl - 2.12: &ldquo;Summer School: Chapter Twelve&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Supergirl - 6.17: &ldquo;I Believe in a thing Called Love&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.03: &ldquo;Freeze&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.03: &ldquo;wvrdr_error_100 not found&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Stargirl - 2.13: &ldquo;Summer School: Chapter Thirteen&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Supergirl - 6.18: &ldquo;Truth or Consequences&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.04: &ldquo;Antifreeze&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.04: &ldquo;Speakeasy Does It&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Supergirl - 6.19: &ldquo;The Last Gauntlet&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Supergirl - 6.20: &ldquo;Kara&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.05: &ldquo;A Lesson From Professor Pyg&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.05: &ldquo;It&rsquo;s a Mad, Mad, Mad, Mad Scientist&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> The Flash - 8.01: &ldquo;Armageddon, Part 1&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.06: &ldquo;How Does Your Garden Grow?&rdquo;&ldquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.06: &ldquo;Deus Ex Latrina&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> The Flash - 8.02: &ldquo;Armageddon, Part 2&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.07: &ldquo;Pick Your Poison&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.07: &ldquo;A Woman&rsquo;s Place Is The War Effort!&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> The Flash - 8.03: &ldquo;Armageddon, Part 3&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> The Flash - 8.04: &ldquo;Armageddon, Part 4&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> The Flash - 8.05: &ldquo;Armageddon, Part 5&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois - 2.01: &ldquo;What Lies Beneath&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.08: &ldquo;Trust Destiny&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.08: &ldquo;Paranoid Android&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois - 2.02: &ldquo;The Ties That Bind&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.09: &ldquo;Meet Your Maker&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.09: &ldquo;Lowest Common Denominator&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois - 2.03: &ldquo;The Thing in the Mines&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.10: &ldquo;Toxic&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.10: &ldquo;The Fixed Point&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois - 2.04: &ldquo;The Inverse Method&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Batwoman - 3.11: &ldquo;Broken Toys&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> DC&rsquo;s Legends of Tomorrow - 7.11: &ldquo;Rage Against The Machines&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> Superman &amp; Lois - 2.05: &ldquo;Girl&#x2026; You&rsquo;ll Be a Woman, Soon&rdquo;</li>
<li class="off"><code>[&#xa0;]</code> The Flash - 8.06: &ldquo;Impulsive Excessive Disorder&rdquo;</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-01-27 Thu 08:29</p>
</div>
</body>
</html>
